(in-package :chinese-parser)

(def-tagged-words *adverbs-list* *adverbs-hash*
  ((adv traited-word)
   (adv-yu4 "預")
   (adv-ji1-ben3 "基本")
   (adv-once "一")
   (adv-jue2 "決")
   (adv-naturally "自然")
   (adv-mistakenly "誤")
   (adv-half "半")
   (adv-yi4 "義")
   (adv-yan2 "嚴")
   (adv-on-num-unit
    ;; can be used to modify num-unit
    (adv-time-frequency
     ;; seems all advs on frequency could be used on num-unit?
     (adv-duo1 "多")
     (adv-zheng4 "正")
     (adv-time-year "年")
     (adv-time-at "在")
     (adv-su4 "素")
     "已" "已經" "曾" "曾經" "剛" "早" "就" "正在"
     "常常" "時常" "常" "再" "再次" "再一次" "經常" "隨時"
     "大量" "再度" "一度" "天天" "不再" "相繼" "從"
     "早日" "隨即" "多次" "很少" "老是" "最早" "從未"
     ;; "首次" ;; as QP in CTB
     "暫" "一時" "永" "時刻" "遲遲" "屢" "首度"
     "屢次" "每次" "動輒" "早晚" "遲早" "隨處" "尚未" "偶爾"
     "不停" "一刻不停" "長年" "從沒有" "日夜" "時不時"
     "又一次" "益形" "連環")
    ;;
    (adv-below-zero "零下")
    (adv-word-gong4 "共")
    (adv-word-lian2-xu4 "連續")
    "又" "只" "一共" "總共" "另" "整" "僅" "一連" "區區"
    "快" "累計" "先" "不到" "各" "随便" "全部" "差不多")
   ;;
   (adv-with-shi4
    ;; not all, but most advs that end with '是' could also be
    ;; combined from adv with verb '是'.
    ;; also could penalize these when used as adv, if needed.
    "特別是" "就是" "真是" "也就是" "就算是" "正是"
    "可不是" "不只是" "總算是" "不光是" "比如是" "好象是" "好像是"
    "同是" "即便是" "豈不是" "確是" "便是" "卻是" "由其是"
    )
   ;;
   "狂" "強" "晦" "驟" "好"
   "前前後後" "恰恰" "漸" "濫" "猛" "急"
   "暗中" "奮" "奮力" "謬" "先後" "前後"
   "長期" "集體" "大體" "一手" "特"
   "約" "約莫" "約摸" "大約" "將近" "多半" ;; also approx-unit, but can modify a verb clause
   ;; some advs are tagged as PN in the treebank in some situations
   "怎麼" "怎麼樣" "怎樣" ;; question word, the role is similar to adverb
   "立刻" "相互" "分別" "繼續" "互" "自行" "各自"
   "交互"
   (adv-word-zhi4 "自")
   (adv-word-bing4 "並")
   ;;;;
   (adv-but
    ;; for use in mathcing clauses, e.g. matching 'although', mainly
    ;; in 'although clause (NP adv-but pred)'
    (adv-word-ke3 "可")
    "卻" "而")
   (adv-and-then
    ;; a change of tone, 轉折, currently used for in '(等...) (and-then ...)'
    "才" "這才" "方才" "便"
    )
   "不用" "恐怕" "真" "還" "一起" "連"
   "一定" "別" "相" "首"
   "不必" "互相" "挺" "按時"
   "總是" "必須" "幾乎" "連忙" "還是" "不斷"
   "拼命" "簡直" "千萬" "匆匆" "親自" "竟然"
   "從頭" "堅強" "只好" "重新" "不禁" "緊" "倒" "大體" "居然" "大多" "到處"
   ;; "僅僅" ;; need not repeat
   "親身" "大約"  "詼諧" "不懈" "獨自" "必定" "立即" "如何"
   "不時" "暗暗" "俱" "臨" "再三"  "尚" "趕緊" "一股腦兒" "獨力" "往往" "惟"
   "親手" "依舊" "永遠" "順手" "寧可" "一晃" "從中" "格外" "默默" "集體" "能"
   "不辭辛勞" "興沖沖" "一再"
   (adv-word-xi4
    ;; also adj
    "細")
   "一張一張" "拼死拼活" "拼死" "高聲"
   "稍" "稍微" "微微" "用力" "激動" "偷" "獨" "耐"
   "批量" "單方面" "一心" "沿途" "即席"
   (adv-word-jiang1 "將")
   (adv-word-zhuan3 "轉")
   (adv-word-shi2 "時")
   (adv-word-ben3 "本")
   (adv-also
    ;; for matching with e.g. 'although'
    "總")
   (adv-still
    ;; meaning still (or still-not)
    "仍" "仍然" "仍舊" "仍未")
   (adv-yu4-exceed "逾")
   (adv-ji2 "即")
   "只有"
   "即將" "完全" "無法" "進一步" "越"
   "主要" "共同" "是否" "難" "正式" "真正" "直接"
   "積極" "並不" "均" "絕對" "直" "全" 
   "難以" "全面" "必" "紛" "迅速" "嚴重" "充分"
   "盡快" "不得不" "依法" "毫"
   "現" "之所以" "陸續" "在一起" "竟"
   "提前" "當場" "每" "被迫" "不要" "全力" "盡量"
   "事先" "或" "勢必" "一路" "率先" "豈" "一邊" "向前"
   "同" "怎" "邊" "順便" "未必" "略" "穩步" "一同" "何"
   "無非" "進而" "加緊" "一味" "固然" "盡可能"
   "特地" "哪" "偏" "剛好" "極力" "這"
   ;; "整整" ;; need not repeat, as 整 could be repeated already
   "照樣" "越是" "莫" "難免" "四處" "沒法" "大肆" "不僅僅"
   "擅自" "絲毫" "趕快" "多久" "沒多久" "不多久" "就地"
   "多少" "光是" "加速" "不妨" "一舉" "已然" "處處"
   "如期" "前不久" "終究" "總算" "何必" "確" "以免"
   "就此" "猶" "盡力" "有意" "寧願" "儘早" "提早"
   "無從" "無需" "分" "咋" "爭相" "實地" "一片" "足足"
   "着重" "當面" "總計" "終" "唯" "明" "不免" "一塊"
   "趁機" "定" "著力" "及早" "渾身" "聯手" "以"
   "遂" "依次" "早點" "萬萬" "輪流" "差點" "乃"
   "想方設法" "以上" "第一次" "親眼" "一口氣" "著實"
   "一道" "一併" "謹" "一眼" "恰" "預先" "無可"
   (adv-gai3 "改")
   "怕" "寧" "果真" "彼此" "免得" "借機" "藉機"
   "轉而" "以此" "忙著" "隨之" "務必" "全然" "大舉"
   "毅然" "一經" "共計" "遍地" "充其量" "舉凡" "儘速"
   "徒步" "專程" "上次" "在此" "隱隱"
   "合計" "斷然" "動不動" "部分" "硬是" "壓根" "隨地"
   "好久" "借以" "藉以" "半天" "幹嘛" "隻身" "就要"
   "一塊兒" "片刻" "easily" "非要" "當庭" "順勢" "尤"
   "始" "節節" "悍然" "合力" "何嘗" "己"
   "榮" "滿臉" "廣為" "up" "帶頭" "還算" "勇於" "一窩蜂"
   "原則" "照舊" "只得" "潛心" "大步" "一個勁" "明令"
   "突擊" "百般" "恐" "苦心" "另行" "開始" "稍加"
   "忽而" "甫" "飽" "業已" "競相" "算" "一字"
   "赫然" "先期" "憤而" "合" "縱橫" "多渠道" "忍不住"
   ;;
   "試著" "不曾" "只用" "分外" "不知" "來得" "好歹"
   "胡亂" "下次" "急著" "一頭" "恆" "不啻" "按期"
   "誠" "轉眼" "無不" "樣樣" "不愧" "當即" "不約而同"
   "倉皇" "暫且" "貿然" "截然" "一陣" "何止" "難於"
   "終將" "無端" "他媽" "再有" "從新" "時而" "恣意"
   "速" "成天" "但凡" "不復" "大老遠" "趁早" "全權"
   "輪番" "省的" "成片" "多所" "驟然" "良久" "行將"
   "更形" "黯然" "鮮少" "聯名" "緊速" "超期" "差一點"
   "距今" "嚴加" "至關" "長時間" "同樣的" "連夜"
   "有一些" "深以" "還沒有" "切切" "多末" "挨家挨戶"
   "乘機" "不至" "乍一" "從沒" "將要" "四面"
   "本應" "滿腦子" "專職" "初次" "競價" "多年" "順帶"
   "舉家" "彌足" "毅然決然" "齊聲" "一腳" "甚是" "幾近"
   "憤然" "隨時隨地" "好意思" "整夜" "萬般" "口口聲聲"
   "經已" "一氣" "逐一" "使勁" "未嘗" "因之" "偷著" "夜夜"
   "時時刻刻" "日臻" "競" "深為" "轉瞬" "數度" "慨然"
   "一如" "份外" "漸次" "幸而" "徹夜" "恭" "改而" "一派"
   "隱然" "一股腦" "從旁" "毋寧" "自力" "姑且" "通力"
   "無處" "按崗" "早些" "當街" "團團" "早一點" "分批" "四下"
   "隨團" "滿身" "遠道" "搶先" "在外" "嚴辭" "差一點兒"
   "還未" "在一塊" "一概" "略有" "一天天" "照常" "一腦子"
   "幸虧" "無時無刻" "索性" "謹此" "還沒"
   "藉此" "一不小心" "代為" "按地" "懶得" "倒數" "從不曾"
   "不勝" "一剎那" "嚴詞" "概" "冒死" "臨場" "莫名" "突"
   "隨口" "愈發" "真得" "幾時" "否" "素來" "一而再" "單是"
   "悉心" "惟獨" "徑" "依紀" "終歸" "爭先恐後" "沿街"
   "險些" "非同" "立馬" "幹嗎" "豈止" "總歸" "轟然" "無以"
   "無愧" "不由" "通盤" "故而" "不致" "應聲" "到頭" "足見"
   "哪麼" "從重" "月月" "無時" "越加" "極少" "未免" "寧肯"
   "按理" "只管" "故此" "省得" "真個" "綜上" "先手"
   "每時每刻" "忒" "愣是" "猛然" "無意中" "改天" "陸陸續續"
   "暗裡" "明里" "縱然" "如數" "當真" "古來" "單點"
   "跨所有製" "平白" "成批" "蓄謀" "至為" "往回" "徑自" "不日"
   "生來" "別看" "冉冉" "切勿" "略為" "連番" "宛" "忿" "分步"
   "分業" "轉臉" "窄幅" "稍為" "砰然" "稍嫌" "甚且" "閒步"
   "愈形" "頹然" "分期" "硬生生" "儼" "愈見" "互為" "旋即"
   "純然" "總括" "自當" "好生" "复" "正要" "早前"
   "悉" "憤憤" "益加" "自小" "盛情" "沛然" "於焉"
   "爭先" "傾囊" "赫赫" "大喇喇" "憑空" "兀自" "終而" "唯二"
   "立時" "平生" "迳自" "始克" "約略" "日久" "渾然" "經年"
   "絕然" "傻不愣登" "飄然" "終至" "忽地" "諄諄" "勉力" "偶而"
   "垂垂" "稍事" "多多少少" "翩然" "屈指" "大班式" "EZ" "滿心"
   "快要" "全員" "迅即" "躍躍" "慘澹" "往時" "三不五時" "莫怪"
   "絕少" "煞是" "油然" "照理" "蕭蕭" "一溜煙" "逐層" "據實"
   "隨堂" "一迭" "甚為" "孜孜" "倏然" "縱使" "益發"
   "嘜" "甚少" "單日" "藉此" "巨幅" "素不" "輕意" "全天時"
   "進以" "夾道" "招招" "篤定" "經悉" "經查" "稍有" "勉於"
   "亂刀" "正重" "已往" "過當" "土法" "多日" "逐戶"
   "成心" "一聲聲" "眼看著" "過久" "道是" "輕間" "從本"
   "隨時隨刻" "連人帶車" "據告" "尚無" "結夥" "大不" "其時"
   "趁亂" "嗣機" "急時" "侃侃" "幾度" "不大可能" "自幼" "在旁"
   "密謀" "無證" "在軌" "以期" "例來" "凡事" "及為" "愈加"
   "恨不能" "稍顯" "以圖" "分開來" "巍然" "哨" "三番五次" "頂著"
   "就象" "在早" "不容"
   "還說" "未經"
   "哪天" "很久" "不怎麼" "不單單" "從來不" "孤身" "等下"
   "逐個" "可曾" "沒說的" "往出" "按需" "看著" "至少說" "再一點"
   "而不是說" "就像" "多一點" "看是" "一上來" "也有說" "好比說"
   "總得" "那是說" "少不了" "有時間" "親口" "差點兒" "再一步"
   "只顧" "互相之間" "相對來" "稍侯" "誰知" "崗前" "不甚"
   "好像說" "日常中" "對症" "湊合著" "憑什麼" "事必" "且不" "敞蓋"
   "反先" "從上到下" "每逢" "不大" "大可" "倘或" "驀然"
   "but" "一個接一個" "幾至" "不算" "拒不" "不說" "要說" "兜頭"
   "因此上" "down" "逃詡" "不住" "或將" "盡全力" "彼時" "方能"
   "白手" "或遲或早" "委實" "連日連夜" "以備" "狠著勁" "變著花樣"
   "天生下來" "全身心" "巳經" "毋須" "整夜整夜" "正所謂"
   "此番" "豁然" "靠前" "或曰" "於後" "老有" "在朝" "無足" "幾聲"
   "大踏步" "於中" "不全" "為之" "忽" "白天黑夜" "隔街" "傲然"
   "轉手" "讀起來" "Too" "從頭到腳" "滿口" "倒著" "用不著"
   "即可" "這就" "還用" "一看" "前所" "會否" "格格"
   "從頭至尾" "滿手" "因何" "冷不定" "哪曉得" "第一眼"
   "開宗明義" "據查" "到了" "間或" "眼巴巴" "冒然" "難麼" "就沒"
   "徒自" "全心" "反向" "再而三" "信筆" "定然" "竊" "一丁點" "如否"
   "何苦" "捎帶" "直截" "日日夜夜" "特此" "必竟" "甚到" "趁勢"
   "巳" "好再" "不自而然" "仗膽" "在為" "追根究底" "怔怔" "量身"
   "依律" "無論於" "照直" "好不" "TM" "MD" "合著" "幸辛苦" "與至於"
   "絕非" "越來" "一古腦" "乘亂" "咋一" "嫣然" "逐次" "略加" "相與"
   "協力" "倏忽" "連聲不迭" "草草" "切莫" "竟而" "大凡" "但都"
   "倒數數" "可勁兒" "從何" "有點點" "看樣" "一時半刻" "未尚" "逐級"
   "無何" "從優" "好比方" "正找" "忙不迭" "臨了" "後腳"
   "前腳" "大抵" "奮然" "三天兩頭" "長此" "哆" "其下" "徑直" "怎奈"
   "甭" "妄" "忘自" "攔腰" "敢情" "平空" "踏馬的" "緣何"
   ;;
   (adv-degree ;; cannot be used with verbs like 走, 看, 吃
    ((adv-degree-on-num-unit adv-on-num-unit)
     "相當")
    (adv-word-ri4 "日")
    ((adv-word-suan4-shi4 adv-with-shi4) "算是")
    "非常" "十分" "最" "太" "更" "有點兒" "萬分" "頗"
    "實在" "過分" "尤其" "很" "特別" "善" "超"
    "超級" "極了" "比較" "較" "越來越" "更加"
    "極" "大" "一點" "有點" "有一點" "日益" "多麼" "更為"
    "有些" "高度" "過" "過於" "夠" "極其" "極度" "極之"
    "極為" "最為" "一些" "較為" "日趨" "日漸" "甚"
    "愈" "愈來愈" "太過" "大為" "尤為" "一點點" "頗為"
    "何其" "亟" "不太" "從不" "毫不" "何等" "越發"
    "一點兒" "大加" "略微" "中")
   (adv-range
    ((adv-range-also adv-also)
     "也"
     (adv-range-has-du1 "都" "大都" "全都"))
    "亦" "皆" "盡" "一律" "統統"
    "通通" "悉數" "盡數" "全數"
    )
   (adv-yes-no "不" "沒" "沒有" "有" "非" "未" "無"
               "並不" "並沒" "並沒有" "並無"
               "素不" "素沒" "素沒有" "素無"
               "決不" "決沒" "決沒有" "決非" "決未" "決無"
               "不得" "勿" "毋")))

;; end adverbs
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(def-tagged-words *front-adverbs-list* *front-adverbs-hash*
  ;; some adverbs can also be used at the front of a subj-pred clause
  ((front-adv adv)
   ((front-adv-on-num-unit adv-on-num-unit)
    ;; both front-adv, and can be used to modify num-unit
    "甚至" "這麼" "這樣" "至少" "最後" "有史以來" "也許" "大概"
    "那麼" "此後" "那樣" "另外" "正好" "至多" "其後"
    "之前" "在此之前" "此前" "不止" "後" "今後"
    ((adv-word-zhi3-shi4 adv-with-shi4) "只是")
    )
   ;;
   ((front-adv-with-shi4 adv-with-shi4)
    "特别是" "尤其是" "凡是" "倒是" "像是" "而是" "也是"
    "甚至是" "或許是" "就說是" "那就是" "哪怕是" "首先是"
    )
   ;;
   (adv-word-bu4-ru2 "不如") ;; also verb
   ((adv-front-and-then adv-and-then)
    "然後" "隨後")
   "原來" "剛才" "以後" "從來" "馬上" "確實" "有時候" "最好"
   "首先" "終於" "究竟" "反而" "難道" "本來"
   "基本上" "其實" "一直" "從小" "畢竟"
   "不久" "曾經" "漸漸" "好在" "恰巧" "似乎" "忽然"
   "起先" "從此" "不由得" "這下" "突然" "根本" "雖然" "好像"
   "結果" "一面" "應該" "為什麼" "始終" "好象"
   "為甚麼" "為何" "為甚" "此外" "其次"
   "這麼樣" "那麼樣" "如此"
   "則" "同時" "因此" "那" "當然" "可能" "真的" "到底"
   "實際上" "後來" "肯定" "同樣" "顯然" "比如"
   "就是說" "也就是說" "依然" "最終" "或許" "迄今" "至今"
   "逐漸" "比如說" "例如" "的確" "的而且確" "從而"
   "事實上" "據悉" "接下來" "據說" "加上" "再加上"
   "反正" "因而" "無疑" "與此同時" "就說" "那就說"
   "還有" "何況" "有時" "一向" "對此" "之後" "近來" "也好"
   "總之" "總而言之" "譬如" "看來"
   "看起來" "事後" "事前" "在此之後" "一下子"
   "唯有" "諸如" "到時候" "或者" "難怪" "看上去" "屆時"
   "相反" "所幸" "反倒" "果然" "據稱"
   "一開始" "倒不如" "向來" "換句話說" "何時"
   "曾幾何時" "到時" "好不容易" "說不定" "搞不好" "稍後"
   "不至於" "要不" "彷佛" "不見得" "這時" "為啥"
   "最多" "那時候" "由此" "幸好" "還好" "至此" "有一天"
   "甚至於" "反過來" "這樣一來" "自古" "自古以來"
   "彷彿" "這樣子" "這時候" "無論如何"
   "總的來說" "唯獨" "估計" "想必" "反之" "爾後" "應該說"
   "有一次" "長期以來" "加之" "恰好" "一會" "實則" "不光"
   "不久前" "毫無疑問" "迄今為止" "頂多" "或多或少" "是的"
   "跟着" "繼而" "早先" "比方說" "自然而然" "何以"
   "而後" "稍早" "一早" "突然之間" "除此之外" "聽起來"
   "一路上" "誠然" "按說" "其中" "先來" "那就是說"
   "儼然" "看樣子" "再者" "相對來說" "一天"
   "由此可見" "有朝一日" "自始至終" "由始至終" "怪不得"
   "說到底" "無怪乎" "連日來" "原則上" "下一步" "近年來"
   "長久以來" "多年來" "聽上去" "有可能" "據信" "換言之"
   "更有甚者" "更甚者" "不好意思" "沒準" "從頭到尾"
   "歸根結底" "歸根究底" "歸根結柢" "歸根究柢" "一般來說"
   "到頭來" "長此以往" "回頭" "綜上所述" "這不" "莫非"
   "何妨" "待會兒" "待會" "plus" "頃刻間" "頃刻之間"
   "不一定" "回過頭" "這些年"
   ;;
   "總體上" "歷史上" "什麼時候" "很多時候" "大體上" "難不成"
   "歸根到底" "頓時" "暗地裡" "相較之下" "相反的" "一氣之下"
   "據息" "一下兒" "一直以來" "可以說" "前幾天" "等一下"
   "就此而言" "久而久之" "如上所述" "從此以後" "再則" "背地裡"
   "據此" "自古至今" "一時半會" "即日起" "再不然" "有次"
   "除此以外" "有的時候" "不是說" "還是說"
   "最開始" "說實話" "其實上" "客觀上" "總體來說" "maybe"
   "allright" "到此" "某一天" "同一天" "自此"
   "應當說" "在此同時" "到後來" "這些天" "這個時候" "有生以來"
   "說真的" "不如說" "很久以來" "不知怎的" "與其說" "總體而言"
   "本質上" "有些時候" "多年以來" "據報" "不一會兒" "再者說"
   "據傳" "如此一來" "相形之下" "譬如說" "因此說"
   "這麼一來" "簡言之" "也可以說" "緊結著" "私下里" "至今為止"
   "整體上" "緊接其後" "不一會" "真巧" "儘管如此" "日後"
   "以致於" "值此之時" "長久來" "平心而論" "這下子"
   "長久以往" "從今以後" "不出所料" "現下" "剎時" "一時之間"
   "一年半載" "時至今日" "剎時之間" "稍早前" "這樣下來" "總的說來"
   "一時內" "根本上" "較早前" "於此同時" "在這同時"
   "Then" "那麼說" "從此看來" "一剎間" "不久以後" "一夜之間"
   "隨之而來" "一般來講" "同時間" "再下來" "一天到晚"
   "或者是說" "長遠講" "如此下去" "這樣以來" "目前看來" "幾天來"
   "早幾天" "really" "不僅如此" "霎那間" "相比之下"
   "前一陣" "從那之後" "目前為止" "表面看來" "由此一來"
   "這幾年" "這些年來" "殊不知" "前些時" "很多時" "早些時"
   "一般說來" "不能不說" "話說回來" "例如說" "這樣的話"
   "不經意間" "數日以來" "有一個時候" "這就是說" "倒過來說" "照說"
   "多年前" "天曉得" "不知何故" "有一刻" "前一會兒" "從長遠來看"
   "Anotherwords" "必須說" "長時間來" "好幾次"
   "整個時間" "還不如說" "很久以後" "年復一年" "前些天" "此會兒"
   "從古至今" "然則" "到老來" "你瑪" "不論如何" "易言之"
   "至於說" "於此一來" "有時侯" "從古到今" "綜上所屬" "媽的"
   "自此以後" "無意間" "概而言之" "古往今來" "很快" "非得" "以至" 
   ;;
   "一方面" "另一方面"))

;; end front-adv
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
