(in-package :chinese-parser)

(def-tagged-words *animate-list* *animate-hash*
;; noun for animate objects such as persons, animals
  (@ animate
     "生物" "動植物" "怪物" "行屍" "走肉" "行屍走肉"
     (relationship
      ;; used to mark those representing often human relationship, but
      ;; sometimes also relationship of animals.
      ;; often can be used in "我 的 N", or abbreviated "我 N"
      )
     (@ human
        ;; TODO: distinguish those representing relationship, e.g. 父,
        ;; 母.

        ;; TODO: mark something as male or female, for "爸爸 的 妻子",
        ;; "她 的 丈夫" where something should agree.

        (can-be-title
         ;;
         "东王" "西王" "南王" "北王" "翼王"
         "平西王" "平南王" "靖南王" "兰陵王"
         "礼亲王" "郑亲王" "睿亲王" "豫亲王" "肃亲王" "庄亲王" "克勤郡王" "顺承郡王"
         "吴王" "楚王" "赵王" "胶西王" "济南王" "菑川王" "胶东王"
         "九江王" "韩王" "大梁王"
         "东伯侯" "南伯侯" "西伯侯" "北伯侯"
         ;; usually can be prefixed by surname
         "競選人" "後選人" "候選人" "惡霸" "童鞋"
         "先賢" "聖賢" "翁" "富翁" "英烈" "烈士" "烈女"
         "首富" "傻比" "卿" "叟" "郎" "伉儷" "傻B"
         "俠" "大俠" "大款"
         "婦" "男" "高人" "超人" "神人" "書生" "土鱉"
         "選手" "富豪" "瞎子" "瘋子" "王子" "傻子" "魔頭"
         "狀元" "姑娘" "大爺" "胖子" "健兒"
         )
        "男女" "老幼" "男女老幼"
        ;;
        ((human-relationship relationship)
         ;; NOTE: in general, should explicitly record the
         ;; relationships of each noun?  i.e. for each N1 (not only
         ;; animate), record the N2 such that "N1 的 N2" represent a
         ;; relationship
         ((human-relationship-title can-be-title)
          "晚輩" "少爺" "少奶" "徒弟" "寶寶" "小朋友"
          "師父" "師母" "師兄" "師哥" "師弟" "師姐" "師姊" "師妹"
          "師公" "師祖" "師伯" "師叔" "師侄"
          "同學" "前輩"
          "先生" ;; could also mean husband
          "女士"
          "姑爺" "公公"
          "新娘" "新郎"
          "英雄" "同志" "弟兄" "學長" "老頭" "主子" "校友"
          )
         "知音" "共謀" "近鄰" "後裔" "同謀"
         "偶像" "血脈" "左鄰" "右舍" "左鄰右舍" "鄰舍"
         "同窗" "頭目" "楷模" "死敵"
         "救星" "朋" "信徒" "高徒" "高足" "醫患" "後援"
         "家眷" "眷" "眷屬" "紅粉知己" "紅顏" "知己"
         "妻小" "一家大小"
         (word-human-tu2 "徒") "徒子徒孫"
         "孀" "遺孀" "紅娘" "後嗣" "嗣"
         "郎君" "上司" "老兄" "祖先" "配偶" "對像" "同僚"
         "伴侣" "同伴" "伴" "玩伴" "隊伍" "同伙" "遠親" "摯親"
         "老鄉" "世交" "點頭之交" "深交" "至交" "跟班"
         "親信" "死黨" "同黨" "祖上" "顧主" "同行" "智囊"
         "小孩"
         ;; quite specialized, so not put in kinship titles
         "皇阿瑪" "阿瑪"
         ;;
         "娃娃" "娃"
         "長輩" "老祖宗" "祖宗"
         "男人" "女人" ;; could also mean 'significant other'
         "手下" "部下" "鄰人" "證人" "線人" "敵人" "故人"
         "後人" "傳人" "仇人" "债权人"
         "敵" ;; often paired with adjective at front
         "同業" "殘部" "全家人" "領袖" "同行"
         "同胞" "僑胞" "父老" "大老" "對手"
         "家屬" "龜兒子" "老娘" "網友" "球友"
         "大佬" "伙伴" "戀人" "鄉親"
         "影迷" "馬子" "頭子" "奴隸"
         "宗親" "同鄉" "影友" "闔家" "冤家"
         "全家" "東家" "對頭" "上頭" "僱員" "外遇"
         "情婦" "情夫" "情敵" "客人" "主人" "鄰居"
         "比鄰" "鄰" "家長" "頭兒" "同事" "老子" "鄰里"
         "丫頭" "病友" "房東" "東家" "娘家" "親人"
         "恩人" "愛人" "至親" "搭檔" "拍檔" "小三"
         "店東"
         )
        ;;
        "主使" "包租婆" "包租公" "大眾" "公眾" "群眾"
        "老滑头"
        "士" "無賴" "泛泛之輩" "始祖" "胞胎"
        "害群之馬" "魁" "菜鳥" "傻瓜"
        "群雄" "雄" "霸" "一方之霸" "憤青" "廢青"
        "先鋒" "前鋒" "精銳" "門閥" "閥閱" "急先鋒"
        "鼠輩" "賢達" "人選" "仕" "中國通"
        "新貴" "老一輩" "先輩" "後生晚輩"
        "騷貨" "妖艷賤貨" "人質" "老貪"
        "牛仔" "政要" "主謀"
        ;;
        "笨蛋" "壞蛋" "混蛋" "蠢蛋"
        "王八蛋" "王八" ;; 王八 also means turtoises
        ;;
        "校花" "班花" "系花" "韃虜" "韃子" "胡虜"
        "大腕"
        "敗類" "土豪" "紳" "元老"
        "嬉皮" "嬉皮士" "文盲" "人瑞" "新秀"
        "從犯" "色狼" "白痴"
        (word-human-fan4 "犯")
        (human-han4 "漢")
        "流氓" "氓" "人渣" "北漂" "人潮" "生靈"
        "老弱" "病殘" "井民"
        "女中豪傑" "台柱" "惡棍" "勞模"
        "援" "美援" "商旅" "豪傑"
        "天才"
        "紈絝" "難兄難弟" "豪強" "海歸" "好事之徒"
        "高幹" "高幹子弟" "班底" "窩囊廢" "子弟"
        "巨富" "豪富" "老少"
        "寇"
        "炎黃子孫" "子子孫孫"
        (human-word-po2 "婆")
        "主嫌" "凶嫌"
        "洋奴" "妞" "嬤" "嬤嬤"
        "有識之士" "卡奴"
        "原告" "被告" "老革命" "兵哥"
        "共匪" "綁匪" "瞽"
        (word-culprit
         ;; also used metaphorically, e.g. '北部人口寿命缩减 的 元凶'
         "原兇" "元兇"
         "幫兇" "兇手" "真兇" "疑兇")
        "金剛" "老幾"
        "侏儒" "傀儡" "主人公"
        "官僚" "儒"
        "才俊" "戰俘" "俘虜" "佳偶"
        "團伙" "群倫" "鄉巴佬"
        "烏合之眾" "信眾" "教眾" "一伙"
        "後代"
        "臭老九"
        (word-human-xiao1 "梟")
        "BAND" "壯丁" "男丁"
        "玉女" "男男女女" "處女" "處男"
        "用户" "千家萬戶" "散户"
        "嬉皮士" "仁人志士" "哲士"
        "版主" "户主" "女流" "大流" "名流" "賓" "嘉賓"
        "光棍" "東道主" "博主" "事主" "金主"
        "回民" "原住民" "外行" "内行" "菁英"
        "僑" "僑鄉" "原著" "土著" "草民" "網民" "壳民" "榮民"
        (word-human-zhong4 "眾")
        "個體" "一把手" "人手" "活口" "两口"
        "士農工商" "外商" "童子" "童" "病号"
        "大盘商" "中盘商" "小盘商" "童稚"
        (family
         ((family-relationship relationship)
          "家室" "家族" "宗族" "同族"
          )
         "皇室" "王室")
        (group-of-people ;; a general group of people
         "顶客" "丁客" "月光族"
         ;; 群 could mean a group of things, either animate or inanimate
         ;; but when not modified, we assume it means a group of people
         "種群" "社群"
         ((group-of-people-ind ind) "群"))
        ((family-member relationship) "家人")
        ((human-name nr-name) ;; some clases for names
         (famouse-human
          "莎士比亞" "王婆"
          ;; some historical names, including the surname
          "司马相如" "扬雄" "班固" "张衡" "李白"
          "杜甫" "白居易" "元稹" "苏轼" "辛弃疾"
          "柳永" "李清照" "周邦彦" "关汉卿" "马致远"
          "白朴" "郑光祖" "罗贯中" "施耐庵" "吴承恩"
          "曹雪芹" "杨朔" "魏巍" "秦牧" "刘伯羽"
          "吴伯箫" "王勃" "杨炯" "卢照邻" "骆宾王"
          "欧阳洵" "褚遂良" "虞世南" "薛稷" "杜审言"
          "崔融" "李峤" "苏味道" "颜真卿" "柳公权"
          "赵孟頫" "蔡襄" "黄庭坚" "米芾" "苏东坡"
          "王安石" "欧阳修" "张耒" "晃无咎" "秦观"
          "谢良佐" "游酢" "杨时" "吕大临" "李唐"
          "刘松年" "马远" "杨万里" "陆游" "范成大"
          "尤袤" "黄晋" "虞集" "柳贯" "揭俊斯"
          "黄公望" "吴镇" "倪瓒" "王蒙" "杨载"
          "范椁" "揭俟斯" "高启" "张羽" "徐贲"
          "杨基" "唐伯虎" "祝枝山" "文征明" "周文宾"
          "徐祯卿" "王时敏" "王鉴" "王原祁" "方以智"
          "陈贞慧" "冒襄" "侯方域" "牛郎" "织女"
          "孟姜女" "梁山伯" "祝英台" "伏羲" "神农"
          "黄帝" "少昊" "颛顼" "喾" "尧"
          "姜桓楚" "鄂崇禹" "姬昌" "崇侯虎" "颜回"
          "闵损" "冉耕" "冉雍" "冉求" "仲由"
          "宰予" "端沐赐" "言偃" "卜商" "颛孙师"
          "曾参" "澹台灭明" "宓不齐" "原宪" "公冶长"
          "南宫括" "公皙哀" "曾蒧"
          "颜无繇" "商瞿" "高柴" "漆雕开" "公伯缭"
          "司马耕" "樊须" "公西赤" "巫马施" "梁鳣"
          "颜幸" "冉孺" "曹恤" "伯虔" "公孙龙"
          "冉季" "公祖句兹" "秦祖" "漆雕哆" "颜高"
          "漆雕徒父" "壤驷赤" "商泽" "石作蜀" "任不齐"
          "公良孺" "后处" "秦冉" "公夏首" "奚容箴"
          "公肩定" "颜祖" "鄡单" "罕父黑" "秦商"
          "申党" "颜之仆" "荣旗" "县成" "左人郢"
          "燕汲" "郑国" "秦非" "施之常" "颜哙"
          "步叔乘" "原亢籍" "乐欬" "廉絜" "叔仲会"
          "颜何" "狄黑" "邦巽" "孔忠" "公西舆如"
          "公西箴" "齐桓公" "宋襄公" "晋文公" "秦穆公"
          "楚庄王" "孔子" "老子" "墨子" "张远山"
          "公孙接" "田开疆" "貂蝉" "西施" "王昭君"
          "杨贵妃" "勾践" "范蠡" "文种" "左丘明"
          "孙膑" "庞涓" "平原君" "赵胜" "孟尝君"
          "田文" "信陵君" "魏无忌" "春申君" "黄歇"
          "白起" "王翦" "廉颇" "李牧" "荆轲"
          "专诸" "聂政" "要离" "苏秦" "张仪"
          "蔺相如" "蒙恬" "韩信" "张良" "萧何"
          "英布" "彭越" "李广" "李敢" "李陵"
          "贾谊" "晁错" "司马迁" "杨雄" "刘濞"
          "刘戊" "刘遂" "刘印" "刘辟光" "刘贤"
          "刘雄渠" "卫清" "霍去病" "许虔" "许劭"
          "邓禹" "吴汉" "贾复" "耿弇" "寇恂"
          "岑彭" "冯异" "朱祜" "祭遵" "景丹"
          "盖延" "铫期" "耿纯" "臧宫" "马武"
          "刘隆为一列" "马成" "王梁" "陈俊" "杜茂"
          "傅俊" "坚镡" "王霸" "任光" "李忠"
          "万修" "邳彤" "刘植" "王常" "李通"
          "窦融" "卓茂" "孔融" "陈琳" "王粲"
          "徐干" "阮禹" "应瑒" "刘桢" "颜良"
          "文丑" "张颌" "高览" "淳于琼" "华歆"
          "邴原" "管宁" "张昭" "张纮" "孙乾"
          "简庸" "糜竺" "曹豹" "诸葛亮" "诸葛瑾"
          "诸葛诞" "曹操" "曹丕" "曹植" "刘备"
          "关羽" "张飞" "蒋琬" "董允" "费袆"
          "赵云" "马超" "黄忠" "阮籍" "嵇康"
          "山涛" "刘伶" "阮咸" "向秀" "王戎"
          "陈翔" "范滂" "孔昱" "范康" "檀敷"
          "张俭" "刘表" "岑咥" "司马朗" "司马懿"
          "司马孚" "司马旭" "司马恂" "司马进" "司马通"
          "司马敏" "蹇硕" "袁绍" "鲍鸿" "赵融"
          "冯芳" "夏牟" "张让" "赵忠" "夏恽"
          "郭胜" "孙璋" "毕岚" "段摇" "高望"
          "张恭" "韩悝" "宋典" "粟嵩" "冯翎"
          "山子道" "王九真" "郭凯" "王恺" "石崇"
          "汝南王亮" "楚王玮" "赵王伦" "齐王冏" "河间王颙"
          "成都王颖" "长沙王乂" "东海王越" "王导" "谢玄"
          "陆机" "陆云" "谢灵运" "谢惠连" "谢眺"
          "斛律光" "高长恭" "顾恺之" "陆探微" "张僧繇"
          "史万岁" "韩擒虎" "贺若弼" "杨素" "房玄龄"
          "杜如悔" "杜如晦" "于志宁" "苏世长" "薛收"
          "褚亮" "姚思廉" "陆德时" "孔颖达" "李玄道"
          "李守素" "蔡允恭" "颜相时" "许敬宗" "薛元敬"
          "盖文达" "苏勖" "贺知章" "张旭" "包融"
          "张若虚" "安录山" "史思明" "薛德音" "李贺"
          "李商隐" "鸠摩罗什" "玄奘" "延平" "延定"
          "延朗" "延辉" "延德" "延昭" "延嗣"
          "延顺" "程颢" "程颐" "李伯时" "李亮工"
          "李元中" "苏洵" "苏辙" "韩愈" "柳宗元"
          "曾巩" "夏圭" "韩世忠" "岳飞" "张浚"
          "刘琦" "窝阔台" "哲别" "者勒蔑" "速不台"
          "博尔忽" "博尔术" "木华黎" "赤老温" "张梦晋"
          "杨士奇" "杨荣" "杨溥" "袁宏道" "袁中道"
          "袁宗道" "杨涟" "左光斗" "魏大中" "周朝瑞"
          "袁化中" "顾大章" "顾炎武" "黄宗曦" "王夫之"
          "戚继光" "袁崇焕" "郑成功" "陶渊明" "李渤"
          "周敦颐" "王阳明" "吴三挂" "尚之信" "耿精忠"
          "肃顺" "载垣" "端华" "焦佑瀛" "杜翰"
          "景寿" "穆荫" "匡源" "林旭" "杨锐"
          "谭嗣同" "康广仁" "刘光第" "杨深秀" "杨秀清"
          "萧朝贵" "冯云山" "韦昌辉" "石达开"
          ;; some names of China political figures
          "阿沛.阿旺晉美" "阿沛" "阿旺晉美"
          "艾力更.依明巴海" "艾力更"
          "依明巴海" "安子介" "阿不來提.阿不都熱西提"
          "阿不來提" "阿不都熱西提"
          "薄一波" "布赫" "白瑪赤林" "包爾漢.沙希迪" "包爾漢"
          "沙希迪" "巴金" "白立忱" "巴特爾" "薄熙來"
          "陳雲" "陳毅" "遲浩田" "曹剛川" "陳希"
          "陳全國" "陳敏爾" "蔡奇" "陳慕華" "陳丕顯"
          "陳錫聯" "程子華" "陳叔通" "程潛" "蔡暢"
          "楚圖南" "程思遠" "曹志" "成思危" "陳至立"
          "陳昌智" "陳竺" "曹建明" "蔡達峰" "陳俊生"
          "常萬全" "蔡廷鍇" "陳嘉庚" "陳錦華" "陳奎元"
          "陳宗興" "陳元" "陳曉光" "陳永貴" "陳伯達"
          "陳希同" "陳良宇" "成克傑" "鄧小平" "董必武"
          "鄧穎超" "丁關根" "丁薛祥" "鄧力群" "杜青林"
          "丁石孫" "丁仲禮" "鄧子恢" "戴秉國" "董其武"
          "丁光訓" "董寅初" "董建華" "鄧朴方" "丹增嘉措"
          "方毅" "范長龍" "費孝通" "傅鐵山" "傅作義"
          "耿飈" "郭金龍" "郭聲琨" "谷牧" "郭沫若"
          "甘苦" "顧秀蓮" "高崇民" "辜勝阻" "高雲龍"
          "高崗" "郭伯雄" "胡錦濤" "華國鋒" "胡耀邦"
          "黃菊" "賀國強" "韓正" "賀龍" "胡喬木"
          "回良玉" "胡春華" "黃坤明" "黃克誠" "何勇"
          "何長工" "黃火青" "黃華" "黃炎培" "何香凝"
          "胡厥文" "胡愈之" "韓先楚" "何魯麗" "韓啟德"
          "華建敏" "郝明金" "韓杼濱" "胡子昂" "華羅庚"
          "胡繩" "侯鏡如" "洪學智" "霍英東" "胡啟立"
          "郝建秀" "黃孟復" "何厚鏵" "何立峰" "何維"
          "黃永勝" "江澤民" "賈慶林" "姜春雲" "江華"
          "姬鵬飛" "蔣正華" "蔣樹聲" "吉炳軒" "賈春旺"
          "季方" "經叔平" "紀登奎" "江青" "柯慶施"
          "康世恩" "康克清" "康生" "劉少奇" "李富春"
          "李先念" "李鵬" "李瑞環" "李克強" "劉華清"
          "李嵐清" "李長春" "羅干" "劉雲山" "栗戰書"
          "林伯渠" "羅榮桓" "劉伯承" "李井泉" "李德生"
          "廖承志" "李鐵映" "李錫銘" "劉淇" "李源潮"
          "劉延東" "劉奇葆" "李建國" "劉鶴" "李希"
          "李強" "李鴻忠" "李雪峰" "李維漢" "陸定一"
          "羅瑞卿" "劉寧一" "劉瀾濤" "李濟深" "林楓"
          "廖漢生" "雷潔瓊" "盧嘉錫" "李沛瑤" "路甬祥"
          "李貴鮮" "梁光烈" "龍雲" "劉復之" "李四光"
          "李燭塵" "李德全" "劉斐" "劉靖基" "羅豪才"
          "廖暉" "李兆焯" "李蒙" "李金華" "林文漪"
          "厲無畏" "羅富和" "李海峰" "盧展工" "劉曉峰"
          "梁振英" "李斌" "劉新成" "李素文" "林彪"
          "李作鵬" "毛澤東" "孟建柱" "馬凱" "馬敘倫"
          "馬文瑞" "茅以升" "馬萬祺" "毛致用" "馬飈"
          "馬培華" "聶榮臻" "倪志福" "歐陽欽" "彭真"
          "彭德懷" "彭沖" "帕巴拉.格列朗傑" "帕巴拉" "格列朗傑"
          "彭佩雲" "喬石" "秦基偉" "錢其琛" "確吉堅贊"
          "錢昌照" "屈武" "錢學森" "錢偉長" "錢正英"
          "錢運錄" "齊續春" "邱會作" "任弼時" "榮毅仁"
          "任建新" "熱地" "芮杏文" "宋平" "宋慶齡"
          "蘇振華" "宋任窮" "孫春蘭" "賽福鼎.艾則孜" "賽福鼎"
          "艾則孜" "粟裕" "沈鈞儒" "史良" "孫起孟"
          "司馬義.艾買提" "司馬義" "艾買提" "盛華仁"
          "司馬義.鐵力瓦爾地"
          "鐵力瓦爾地" "桑國衛" "沈躍躍" "宋健" "沈雁冰"
          "沙千里" "孫曉村" "蘇步青" "孫孚凌" "孫家正"
          "蘇輝" "邵鴻" "孫健" "孫政才" "蘇榮"
          "陶鑄" "譚震林" "田紀雲" "譚紹文" "譚政"
          "鐵木爾.達瓦買提" "鐵木爾" "達瓦買提" "唐家璇" "滕代遠"
          "童第周" "陶峙岳" "萬里" "吳邦國" "溫家寶"
          "尉健行" "吳官正" "王岐山" "汪洋" "王滬寧"
          "韋國清" "王震" "烏蘭夫" "吳學謙" "王樂泉"
          "王兆國" "吳儀" "王剛" "王晨" "王漢斌"
          "王稼祥" "王任重" "王首道" "王丙干" "王光英"
          "吳階平" "烏雲其木格" "王勝俊" "萬鄂湘" "王東明"
          "武維華" "王芳" "王忠禹" "王勇" "魏鳳和"
          "王毅" "衛立煌" "王崑崙" "王恩茂" "汪鋒"
          "萬國權" "王文元" "王選" "王志珍" "萬鋼"
          "王家瑞" "王正偉" "王欽敏" "汪永清" "汪東興"
          "吳德" "吳桂賢" "王洪文" "吳法憲" "習近平"
          "徐向前" "許世友" "習仲勛" "謝非" "許其亮"
          "蕭克" "蕭勁光" "許德珩" "許嘉璐" "向巴平措"
          "肖捷" "謝覺哉" "肖揚" "徐冰" "徐匡迪"
          "夏寶龍" "謝富治" "徐才厚" "葉劍英" "楊尚昆"
          "俞正聲" "姚依林" "余秋里" "楊得志" "楊汝岱"
          "楊白冰" "楊潔篪" "楊曉渡" "楊勇" "尤權"
          "楊明軒" "嚴濟慈" "葉飛" "嚴雋琪" "楊靜仁"
          "楊秀峰" "楊易辰" "楊成武" "葉聖陶" "葉選平"
          "楊傳堂" "閻明復" "楊晶" "姚文元" "葉群"
          "姚連蔚" "周恩來" "朱德" "朱鎔基" "張德江"
          "曾慶紅" "張高麗" "趙樂際" "張聞天" "張廷發"
          "鄒家華" "張萬年" "張立昌" "曾培炎" "張春賢"
          "張又俠" "張震" "趙洪祝" "張愛萍" "張勁夫"
          "張瀾" "張治中" "周建人" "張鼎丞" "朱蘊山"
          "朱學范" "周谷城" "周光召" "周鐵農" "張平"
          "張寶文" "章伯鈞" "趙克志" "鄭天翔" "張思卿"
          "周強" "張軍" "張沖" "莊希泉" "周培源"
          "周叔弢" "趙朴初" "朱光亞" "趙南起" "張克輝"
          "張懷西" "張梅穎" "張榕明" "鄭萬通" "張慶黎"
          "周小川" "鄭建邦" "趙紫陽" "張春橋" "周永康"
          ;;
          )
         (common-whole-name
          ;; some English names from http://www.yces.chc.edu.tw/english/engboyname-all.htm
          ;; some confusing ones and those being names of other things are removed
          "阿貝" "亞拜爾" "亞伯勒"
          "亞伯拉罕" "亞倫" "亞當"
          "亞道夫" "艾爾賓" "艾爾頓"
          "艾尼賽斯" "安布魯斯" "安摩斯"
          "阿德里安" "阿爾" "阿伯特"
          "亞歷山大" "艾爾弗雷德" "阿利斯泰爾"
          "阿爾文" "安德魯" "安迪"
          "安士姆" "安索尼" "安東尼"
          "安格斯" "阿奇博爾" "阿奇"
          "阿諾德" "阿瑟" "奧古斯丁"
          "奧伯倫" "奧布里"
          "布爾文" "伯川" "布里安"
          "巴納比" "巴里" "巴塞洛繆"
          "巴士爾" "班捷明"
          "伯納德" "伯尼" "伯特"
          "比爾" "比利" "鮑伯"
          "巴比" "鮑里斯" "布拉德富得"
          "布拉德" "布蘭頓" "布倫丹"
          "布萊恩" "布魯斯" "巴德"
          "布爾" "凱撒" "卡汶"
          "卡爾頓" "卡里" "克尼斯丁"
          "卡爾" "塞西爾" "錫德里克"
          "查理士" "察理" "查克"
          "克里斯多福"  "克里斯" "克拉倫斯"
          "克拉克" "克勞德" "克里門"
          "克萊爾" "康斯坦" "寇蒂斯"
          "克里福特" "克利夫" "克林特"
          "克萊夫" "克萊德" "科林"
          "克雷格" "柯特" "西里爾"
          "卡茲伯特" "戴克斯特" "大貝"
          "戴爾" "丹尼爾"
          "丹尼" "達雷爾" "達倫"
          "大衛" "戴夫" "狄恩"
          "丹尼斯" "德瑞克" "德莫特"
          "德斯蒙得" "德斯" "狄克"
          "德克" "唐納德"
          "道格拉斯" "道格"
          "杜安" "達德利" "達德"
          "鄧肯" "達斯丁" "德懷特"
          "杜克" "愛爾" "愛賓里查"
          "愛蒙" "愛迪" "埃德加"
          "愛德蒙" "愛德華" "愛德溫"
          "艾略特" "愛墨" "埃爾羅伊"
          "埃姆林" "伊諾克" "埃里克"
          "歐內斯特" "埃羅爾"
          "愛理" "依拉" "弗雷迪"
          "費里克斯" "費迪南德" "弗格斯"
          "弗洛伊德" "法郎西斯" "法蘭克"
          "弗蘭基" "弗雷德雷克" "弗雷德"
          "蓋布頓" "蓋布瑞爾" "加雷思"
          "蓋瑞" "加文" "吉恩"
          "杰弗里" "杰夫" "喬治"
          "杰倫特" "吉瑞爾" "格里"
          "杰勒德" "吉伯特" "賈爾斯"
          "格倫" "戈弗雷" "戈登"
          "格雷厄姆" "格雷姆" "格雷戈里"
          "格雷格" "蓋伊" "吉地恩"
          "格蘭德" "漢弗萊" "哈爾"
          "漢克" "哈囉德" "哈利"
          "亨利" "赫伯特" "霍勒斯"
          "霍華德" "休伯特"
          "漢米爾頓" "海克特" "海曼"
          "雨果" "赫曼" "希拉瑞"
          "霍威爾" "亨佛來"
          "海瑞" "荷馬" "伊恩"
          "艾薩克" "伊凡" "艾弗"
          "埃拉" "埃文" "埃溫"
          "賈維斯" "傑恩" "嘉伯"
          "傑克" "傑柯" "杰克"
          "詹姆士" "杰米" "傑生"
          "賈斯珀" "杰德" "傑夫"
          "傑夫瑞" "杰里米" "杰羅姆"
          "吉瑞" "杰西" "傑西"
          "吉姆" "吉米" "喬克"
          "喬" "約翰" "強尼"
          "喬納森" "喬恩" "約瑟夫"
          "約書亞" "朱利安" "賈斯丁"
          "諸理斯" "卡爾"
          "克士" "肯尼思"
          "肯尼" "肯特" "凱文"
          "凱特" "凱夫" "柯克"
          "雷班" "蘭斯"
          "賴利" "勞倫斯" "萊恩"
          "倫尼" "李奧" "李納德"
          "萊斯" "萊斯利" "萊斯特"
          "李恩" "林肯"
          "劉易士" "利亞姆" "萊昂內爾"
          "路易士" "路克"
          "路喜斯" "奈曼"
          "馬爾克姆" "馬克" "馬丁"
          "邁拉基" "馬歇爾" "馬芬"
          "馬蒂" "馬特" "馬休"
          "邁林" "美爾頓" "蒙諾"
          "莫里斯" "馬克斯" "默文"
          "麥可" "米克" "米基"
          "邁爾斯" "麥克" "米奇"
          "米切爾" "莫里斯" "莫特"
          "墨瑞" "莫根" "蒙哥馬莉"
          "納阿美" "納特" "內森"
          "雷休" "拿破崙" "納爾生"
          "半頓" "諾亞" "諾爾伯"
          "納撒尼爾" "尼爾" "尼得"
          "尼地" "尼可拉斯" "尼克"
          "尼基" "奈杰爾" "諾爾"
          "諾姆" "諾爾曼" "奧利"
          "奧利佛" "奧斯卡" "奧斯瓦爾德"
          "奧茲" "奧齊"
          "阿克特佛斯" "奧斯曼" "鄂圖"
          "帕迪" "帕特" "派翠克"
          "保羅" "珀西" "皮特"
          "彼得" "菲爾" "菲力蒲"
          "波瑞吉" "皮爾斯" "伯理"
          "佛蘭德" "菲理蒙" "派爾斯"
          "昆廷" "昆西" "瑞雷"
          "魯濱" "拉爾夫" "倫道夫"
          "蘭迪" "拉斐爾"
          "雷蒙" "雷吉" "雷金納德"
          "雷克斯" "理察" "里奇"
          "里克" "里基" "羅布"
          "羅比" "博比" "羅勃"
          "羅賓" "羅德" "羅德里克"
          "羅德尼" "羅捷" "羅傑"
          "羅諾德" "羅恩" "龍尼"
          "羅尼" "羅伊" "魯道夫"
          "魯弗斯" "魯珀特" "拉斯"
          "魯爾" "羅蘭德"
          "羅斯" "羅素" "撒姆森"
          "索爾" "山姆" "薩米"
          "山謬爾" "山帝" "司各脫"
          "謝默斯" "肖恩" "塞布"
          "塞巴斯帝安" "錫德"
          "西蒙" "斯坦" "斯坦萊"
          "史蒂夫" "史蒂芬" "史蒂華"
          "辛克萊" "所羅門" "史都華"
          "泰德" "泰德" "特爾"
          "特倫斯" "得利" "西奧"
          "西奧多" "湯瑪斯" "帝姆"
          "提米" "帝莫西" "扥比"
          "湯姆" "湯米" "東尼"
          "狄亞寶特" "狄奧多理" "泰倫斯"
          "特雷弗" "特洛伊" "烏爾班"
          "范" "維維安" "維克"
          "維克扥" "文斯" "文森特"
          "維夫" "華萊士" "沃利"
          "華爾特" "華倫" "韋恩"
          "偉斯理" "溫斯敦" "威爾"
          "威爾伯" "威爾弗里德" "威利"
          "威廉" "威利斯" 
          ;;
          ;; still others from http://www.yces.chc.edu.tw/english/enggirlname-all.htm
          "愛比蓋爾" "愛達" "阿加莎"
          "愛得雷德" "愛得乃納" "艾妮沙亞"
          "阿吉" "艾格妮斯" "愛琳"
          "愛歷克斯" "亞歷山卓拉" "亞歷克西斯"
          "愛麗斯" "艾莉森" "愛曼達"
          "安琪拉"
          "安妮塔" "安娜"
          "安納貝爾" "安妮" "安妮特"
          "安西婭" "安東尼婭" "奧黛麗"
          "愛麗蓀" "愛瑪" "愛妮莎"
          "安吉莉嘉" "艾蓓夏" "娥瑞妮亞"
          "愛娃" "艾佛絲" "蓓達"
          "蓓莉" "芭布斯" "芭芭拉"
          "比阿特麗斯" "蓓琪" "比琳達"
          "伯納黛特" "貝里爾" "貝蒂"
          "比德" "布倫達" "布里奇特"
          "布莉坦妮" "白莎" "波妮"
          "卡彌拉" "坎迪斯" "卡拉"
          "卡洛" "卡洛琳" "卡麗"
          "凱薩琳" "凱西" "西西莉亞"
          "塞西莉" "西莉婭" "查倫"
          "雀莉" "謝里爾"
          "克洛伊" "克里斯" "克里西"
          "克里斯蒂娜" "克莉斯汀" "辛蒂"
          "克萊爾" "克勞地婭" "克利奧"
          "康尼" "康斯坦思" "克莉斯朵"
          "凱蒂達" "卡嫚" "西來絲汀"
          "卡瑞莎" "可琳" "可娜"
          "可瑞納" "辛西亞" "桃爾西"
          "多蒂" "黛西" "達夫妮"
          "黛布" "黛比"
          "黛博拉" "迪爾德麗" "迪莉亞"
          "黛拉" "丹尼斯"
          "黛安娜" "黛安" "多利"
          "戴娜" "多拉" "多琳"
          "桃樂絲" "朵勒絲" "多特"
          "艾娃" "伊迪斯" "愛德娜"
          "愛琳" "伊萊恩" "愛莉諾"
          "愛莉諾拉" "伊萊扎" "伊莉莎白"
          "愛拉" "愛倫" "愛莉"
          "愛薾莎" "愛爾西" "愛爾思佩思"
          "愛蜜莉" "愛瑪" "愛里卡"
          "愛塞爾" "尤妮絲" "伊娃"
          "伊娃" "伊芙琳" "尤金妮亞"
          "尤勒莉亞" "伊文妮" "依文吉琳"
          "福斯太娜" "費莉西蒂"
          "費德莉亞" "費歐娜" "弗洛"
          "弗洛拉" "弗羅倫斯" "范麗西亞"
          "福來菲亞" "法妮達" "弗雷達"
          "弗洛里" "弗蘭" "弗蘭西斯"
          "弗朗基"
          "喬治" "喬治娜" "杰拉爾丁"
          "杰曼" "格蒂" "格特魯德"
          "吉爾" "吉利恩" "琴妮"
          "格拉迪斯" "格倫達" "葛洛莉亞"
          "葛瑞斯" "格雷西" "愛絲莉"
          "格溫" "格溫德林" "漢納"
          "哈麗雅特" "黑茲爾" "赫瑟"
          "亨里埃塔" "喜諾莉"
          "希爾達" "海達" "海薇"
          "海葛" "荷田西亞" "伊莎貝拉"
          "艾維" "愛達" "英格里德" 
          "愛琳" "愛里絲" "伊莎貝爾"
          "芝美瑪" "茱莉安娜"
          "珍妮德" "珍妮"
          "賈妮絲" "杰基" "賈貴琳"
          "珍恩" "珍妮" "珍妮弗"
          "珍妮" "潔斯" "潔西卡"
          "潔西" "吉兒"
          "喬安娜" "喬安妮"
          "喬斯琳" "約瑟芬" "喬西"
          "喬迪" "喬伊思" "茱迪思"
          "茱蒂" "茱莉亞" "朱莉"
          "茱麗葉" "凱倫"
          "凱瑟琳" "凱特" "凱西"
          "凱蒂" "凱莉"
          "金柏莉" "克麗絲坦"
          "基蒂" "凱薩琳" "凱德"
          "莉拉" "勞拉" "洛雷塔"
          "萊斯莉" "莉比" "莉蓮"
          "莉莉" "琳達" "琳賽"
          "麗莎" "莉維亞" "麗茲"
          "洛伊絲" "羅莉" "洛娜"
          "路易莎" "路易絲" "露西亞"
          "露辛達" "露西" "莉迪亞"
          "林恩" "莉絲麗" "露西爾"
          "露露" "梅布爾" "瑪德琳"
          "瑪奇" "瑪吉" "梅西"
          "曼蒂" "瑪西亞" "瑪西"
          "瑪格麗特" "瑪杰里" "瑪麗亞"
          "瑪麗安" "瑪麗" "瑪里琳"
          "瑪琳" "瑪薩" "美拉妮"
          "梅西德絲" "梅英" "美美"
          "瑪莎" "瑪丁娜" "瑪麗"
          "莫德" "莫林" "梅維斯"
          "美格" "美拉尼" "美林達"
          "梅莉莎" "米雪兒" "米爾德里德"
          "米莉森特" "米莉" "米蘭達"
          "米里亞姆" "莫伊拉" "莫莉"
          "莫尼卡" "繆里爾" "米妮"
          "納汀" "妮娜" "納迪亞"
          "南西" "蕾娃米"
          "納塔莉" "納塔莎" "內爾"
          "內莉" "尼基" "尼古拉"
          "妮寇兒" "諾拉" "諾瑪"
          "妮達" "奧格" "奧林匹克"
          "奧莉弗" "奧莉薇雃" "帕姆"
          "潘蜜拉" "派德" "佩興斯"
          "潘絲" "白西絲" "普魯敦斯"
          "派翠西亞" "裴西" "帕蒂"
          "葆拉" "波琳" "裴蘿"
          "佩姬" "佩內洛普" "彭尼"
          "菲莉帕" "菲比" "菲妮斯"
          "波爾" "波利" "普里西拉"
          "普魯" "瑞那" "雷切爾"
          "麗貝卡" "羅達" "麗塔"
          "羅伯塔" "羅賓" "羅莎莉"
          "羅莎琳德" "羅莎琳" "羅絲"
          "羅絲瑪麗" "羅斯" "露比"
          "羅莎" "露絲" "賽羅美"
          "西維亞" "莎蒂" "莎爾"
          "莎莉" "莎姆" "薩曼莎"
          "桑德拉" "桑蒂" "莎菈"
          "雪濃" "希拉" "伽莉"
          "雪莉" "絲波" "西維亞"
          "索尼亞" "蘇菲亞" "蘇佛樂莉亞"
          "索菲" "史黛拉" "史蒂芬妮"
          "蘇珊" "蘇姍娜"
          "蘇西" "蘇姍" "太比莎"
          "特里莎" "特里" "特斯"
          "特薩" "塞爾瑪" "媞娜"
          "賽妮亞" "賽亞" "瑟芝"
          "扥尼" "崔西" "崔西亞"
          "特魯迪" "兒瑞嘉" "尤娜"
          "恩黛" "厄林拉" "尤瑞妮亞"
          "費雯" "維維恩" "瓦爾"
          "瓦萊利" "瓦內薩" "薇拉"
          "維朗妮卡" "維多利亞"
          "維奧拉" "瓦奧來特"
          "維維" "威娜" "溫蒂"
          "威尼弗雷德" "威尼" "伊馮娜"
          "佐伊"  
          )
         (common-name
          ;; from https://zh.wikipedia.org/zh-hk/%E6%9C%80%E5%B8%B8%E8%A6%8B%E5%90%8D%E5%AD%97%E5%88%97%E8%A1%A8
          ;; and from https://china.hket.com/article/1942352/%E4%B8%AD%E5%9C%8B50%E5%A4%A7%E5%B8%B8%E8%A6%8B%E5%90%8D%E5%AD%97%2029%E8%90%AC%E4%BA%BA%E4%B9%9F%E7%94%A8%E7%9A%84%E5%90%8D%E5%AD%97%E6%98%AF%E2%80%A6%E2%80%A6
          ;; TODO: need better heuristic for guessing names!
          ;; want surname for this, if mono
          "偉" "芳" "秀英" "娜" "敏" "靜"
          "睿" "浩" "博" "瑞" "昊" "悅"
          "妍" "涵" "玥" "蕊" "梓" "萱" "彤"
          "浩宇" "子軒" "浩然" "雨澤" "宇軒"
          "子涵" "皓軒" "欣怡" "梓涵" "雨涵"
          "可馨" "詩涵" "梓萱" "雅婷" "怡君"
          "家豪" "志偉" "志豪" "承恩" "承翰"
          "采潔" "沛恩" "志明" "淑芬" "家華"
          "宥翔" "宥廷" "宇恩" "宇翔" "宥辰"
          "品睿" "睿恩" "宸睿" "柏宇" "語彤"
          "品妍" "詠晴" "羽彤" "子晴" "禹彤"
          "品妤" "芯語" "恩綺" "思妤" "正雄"
          "武雄" "文雄" "冠宇" "冠廷" "玉蘭"
          "秀琴" "麗華" "淑惠" "美玲" "雅惠"
          "宜蓁" "欣妤" "品蓁" "彥廷" "柏睿"
          "怡萱" "俊傑" "建宏" "俊宏" "金龍"
          "志強" "美惠" "淑娟" "淑貞" "淑華"
          ;; some common dummy names
          "小明" "大明" "大偉" "大文"
          )
         ;;
         (surname))
        ((human-word-ren2-min2 ind) "人民")
        ((human-ind ind) "人" "民" "奴")
        ;; TODO: write rules for these names of family members
        (kinship
         ;; main reference: https://zh.wikipedia.org/zh-hk/%E6%BC%A2%E8%AA%9E%E8%A6%AA%E5%B1%AC%E7%B3%BB%E7%B5%B1
         ;; supplementary reference: http://hinarthur.com/graphics/articles/relatives.jpg
         ((kinship-relationship relationship)
          ;; basically all are names of relationship, except some
          ;; words, which are not commonly used as such

          ((kinship-relationship-title can-be-title)
           "曾祖" "高祖" "天祖" "列祖" "太祖" "遠祖" "鼻祖"
           "曾祖父" "高祖父" "天祖父" "列祖父" "太祖父" "遠祖父" "鼻祖父"
           "曾祖母" "高祖母" "天祖母" "列祖母" "太祖母" "遠祖母" "鼻祖母"

           "太公" "太婆" ;; "太爺" "太嫲" ;; can be composed with kinship-prefix
           "外公" "爺爺" "爺" "祖父" "姥爺" "阿公"
           "外婆" "奶奶" "嫲嫲" "嫲" "祖母" "姥姥" "婆婆"
           "阿婆"
           "麻麻" ;; internet usage for "嫲嫲"

           "爸爸" "媽媽" "媽" "爸" "媽咪" "父"
           (word-mu3 "母") ;; 母 and 子 could be used as prefixes

           "哥哥" "姐姐" "弟弟" "妹妹"
           "兄" "哥" "弟" "姐" "姊" "妹"
           (word-girl "女")
           "公子" "千金"

           "世侄" "世侄女"

           "伯" "伯伯" "世伯" "伯母"
           "叔" "叔叔"

           "老爺" "相公" "官人" "太太" "夫人"
           )
         
          "生母" "生父"
          "父親" "母親" "父母" "爹" "娘"
          "雙親" "父母親" "血親" "二老" "兩老" "兄長"

          (word-human-er2 "兒")
          "兒子" "孩" "仔" "囝" "囡"
          "女兒" "閨女" "逆子"
          "敗家子" ;; whether to keep this
          ;; may mean the eldest son, or some sort of "leader"
          "老大" "阿大"
          ;;

         "孫" "孫女"
         "曾孫" "重孫" "玄孫" "來孫" "昆孫"
         "晜孫" "仍孫" "雲孫" "耳孫"
          "長子" "長女" "長孫"
         ;;
          "伯父"
          "伯娘" "姆" "伯姆"
          "叔父" "嗒嗒"
          "叔娘" "叔母" "嬸" "嬸嬸" "叔嬸"
          "伯公" "叔公" "伯婆" "叔婆"
          "世叔伯"
         ;;
         "姑" "姑姑" "姑母" "姑媽" "姑姐"
         "姑丈" "姑父"
         "姑丈公" "姑婆"
         ;;
         "舅" "舅舅" "舅父"
         "舅公"
         "舅媽" "妗" "妗妗" "妗母" "舅母"
         "舅婆" "妗婆"
         "姨" "姨姨" "姨媽" "姨母" "姨娘"
         "姨丈" "姨父"
         "姨丈公" "姨公" "姨婆"
         ;;
         "甥" "侄" "姨甥"
         "侄孫" "甥孫"
         ;;
         "家翁" "家姑" "家婆"
         "岳父" "岳丈" "丈人" "丈母達" "外父"
         "岳母" "丈母" "丈母娘" "外母"
         ;;
         "小媳婦" "媳婦" "媳" "新婦" "新抱"
         "婿" "女婿" "贅婿"
         "嫂" "嫂嫂" "嫂子"
         "弟媳" "弟妹" "弟婦"
         "姐夫" "姐夫" "妹婿"
         "妯娌" "小嬸仔"
         "連襟" "襟兄弟" "襟兄" "襟弟"
         "大伯" "小叔" "大姑" "姑奶" "小姑"
         "大舅" "內兄" "小舅" "內弟"
         "大姨" "姨姐" "小姨" "姨妹"
         ;;
         "丈夫" "夫婿" "前夫" "外子"
         "夫君" "老公"
         "妻" "妻子" "老婆" "內子"
         ((word-nei4-ren2 compound) "內人")
         "娘子" "拙荊" "賤內"
         "前妻" "妻兒" "妾" "姬妾"
         ;;
         "親屬" "親戚" 
          )
         ;; not commly used as relationship
         "祖" "戚"
         )
        ;;
        "活動分子"
        (word-nan2-de "男的")
        (word-nu3-de "女的")
        ((human-compound compound)
         ((human-compound-relationship relationship)
          "情人")
         ;; those receiving double penalty for human
         "行家" "業主" "分子们" "志願們" "所化")
        ;;
        ;; TODO: whether to let two animate piece together?
        ;;"兄弟"
        "小伙" "小伙子" ;; problem with 英俊的小伙子 becoming (英俊的 小伙) 子
        (word-ge4-ren2 "個人")
        "一行" "一行人"
        "父子" "漢子" "男孩" "女孩"
        "老外" "老人" "愛好者" "夫婦" "夫妻"
        "母子" "親子"
        "长者" "後者" "前者"
        "小姐"
        
        "聖誕老人" "新鲜人" "千面人"
        "舉世" "後世"
        "行人" "能人" "罪人" "紅人"
        "牛人" "嫌疑人" "大男人" "植物人" "自然人"
        "洋人" "法人" "過來人" "旁人" "犯人" "新人"
        "成人" "自己人" "小人" "孤家寡人" "自家人" "婦人" "老好人"
        "爛好人" "哲人" "古人" "凡人"
        "先人" "眾人" "今人" "當事人" "專人" "遊人" "死人"
        "明眼人" "毛人" "内情人" "责任人" "汽车人"
        "社会人" "经济人" "罪魁" "禍首" "罪魁禍首" "權貴" "餘生者" "帶源者" "志願者"
        "同性戀" "工傷者" "痞" "巨子" "尖子" "孺" "拐子"
        "無名氏" "蒼生" "畜生"
        "男生" "女生" "男女生" "眾生" "黑道"
        "白道" "匹夫" "老淡水"
        ;; some cases to avoid too much ambiguity.
        ;; could have let 日 be shorthand of Japan, but may cause
        ;; too much ambiguity because 日 is a common noun
        "日人"
        "局外人" "客家人" "能者" "筆者" "好者" "勇者" "儒者"
        "佼佼者" "責任者" "好事者" "罪者" "舞者" "所有者" "業者"
        "基督徒" "公诉人" "老饕" "饕" "樓霸" "蠢貨"
        (word-representative "代表")
        "精英" "小嘍羅" "嘍羅"
        "馬屁精" "斑竹" "牛鬼蛇神"
        "師生" "天王" "囚犯" "大牌" "狗熊" "先烈"
        "選民" "公民" "先民" "新手" "生手"
        "歐尼桑" "歐巴桑" "歐吉桑" "奧尼桑" "奧巴桑" "奧吉桑"
        "儲戶" "存戶" "憤們" "头头脑恼"
        "男性" "女性"
        "列強" "毛左" "打工崽" "殭屍"
        "黑客" "游客" "旅客" "少女" "剩女"
        "巨頭" "志士" "勇士" "奸商" "成員" "會員" "道友"
        "尖兵" "情侣"
        "民眾"
        
        "乔迷" "中產" "鬼雜種" "雜種"
        "洋鬼"
        "二鬼子" "鬼子" "天之驕子"
        "達子" "諸子" "班子" "夜猫"
        "犊子" "遊子" "老毛子" "毛子" "小子" "學子" "婊"
        "君子" "口子" "兩口子" "凡夫俗子"
        "凡夫" "俗子" "伙子" "賊"
        "草根" "匪" "黑社會" "平民"
        "老法" "難民" "识家" "店家" "莊家"
        "带家" "小家" "家家" "头家" "商家" "名家" "廠家"
        "公家" "老人家" "世家"
        "少棒隊" "梯隊" "支隊" "外援" "拉拉隊" "總隊" "大隊"
        "分隊" "侦八队" "抗先" "樂隊" "蛇頭"
        "冤大頭" "大頭" "陣員" "行员"
        "大员" "團員" "一员"
      ;;; ???
        "私人" "高尚全们" "廢物" "飯桶" "戴安娜"
      ;;;
        (word-guest "客") "客戶"
        "乘客" "移民"
        "婦女" "老百姓" "百姓" "人才" "婦幼"
        "大人" "大媽" "居民" "市民"
        "黑人" "白人"
        "股東" "船東" "東主"
        "白種人" "黃種人"
        "大人物" "人物" "顧客" "世人" "大伙" "人類" "角色"
        "脚色"
        "大丈夫" "少年" "壞人" "孤兒" "仁兄" "傢伙"
        "青年" "老年" "成年" "中年" "未成年" "青少年"
        "知青" ;; shorthand for 知識青年
        "体青" ;; shorthand for 體育青年??
        "讀書人" "窮人" "啞巴" "完人"
        "紅角" "大角" "混血兒" "新生兒" "婴" "主兒"
        "乞兒" "乞丏" "墨客" "皮条客" "過客"
        ((friend relationship)
         "博友" "難友" "寶友" "摯友" "友人" "親友"
         "親朋好友" "親朋" "至親好友" "囚友" "好友"
         "朋友" "男友" "男朋友" "女朋友" "女友" "閨蜜"
         ((friend-ind ind) "友"))
        (@ occupation
         ((occupation-relationship relationship)
          "老細" "保母" "褓母" "保姆" "奴才" "會長"
          "看護" "武護" "陪護" "隨護" "部屬" "下屬"
          "內應" "奴婢" (word-human-huang2 "皇")
          "奶媽" 
          "叫獸" ;; in China, to refer to 教授
          "外傭" "傭" "黑傭" "女傭" "傭人"
          "僕從" "隨從" "助理" "主任" "系主任"
          "助教" "教授" "伙計" "秘書" "首長"
          "隊長" "大隊長" "幕僚" "科長" "醫生"
          "律師" "大夫" "經紀人" "經理人" "僕人"
          "顧問" "老總" "探子" "司機" "師傅"
          "教練" "弟子" "老師" "廚師" "員工"
          "眼線" "經理"
          (word-boss "老闆" "老板")
          "近衛" "門衛" "仕女" "長官" "侍從"
          "領導" "領導人" "干事"
          "總干事" ;; confused with (VERB-X (ADV 总) (VERB-A (干 事)))
          )
         ;; TODO: how to better handle short-hands ??
         "村委" "执委" "常委" "居委" "奥委" "全委"
         "旅遊委"

         "主婦" "家庭主婦" "名嘴" "司乘" "評委"
         "總指揮" "指揮"
         "評審" "守衛" "評判" "強盜" "主持" "代理"
         "主編" "編緝" "裁判" "仲介" "主演" "偵探"
         ;; "閥" could mean a valve
         "財閥" "黨閥"
         "三陪" "首領" "元首" "特首" "響馬"
         "南商北賈" "主承銷" "承銷商" "保鏢" "武生"
         "閒角" "娛記" "匪諜" "商販" "商賈" "賈"
         "文臣" "朝臣" "武臣" "總裁" "要角" "配角"
         "總編" "首腦" "臣" "使臣" "功臣"
         "神算" "城管" "總管" "高管" "奸細" "內奸"
         "丫環" "總監" "海盜" "外相" "宰相" "首相"
         "影星" "新星" "名演" "神父"
         "主播" "導播" "資政" "女星" "男星" "童星" "巨星"
         "指揮" "女排" "女足" "女籃" "男排" "男足" "男籃"
         "秀才"
         "單幫" "桿弟" "球童"
         "太守" "郡守" "教宗" "宦" "宦官" "巡憲" "助導"
         "部委" "巫婆" "巫" "女巫" "婢" "傳媒"
         "尼姑" "主委" "工委" "紀委" "奧組委" "計委"
         "中堅" "龍套"
         "妃" "嬪" "皇后"
         "天后" "影后" "官吏" "吏" "喇嘛"
         "國務卿" "州務卿" "太常卿" "太常" "祭司"
         "諸侯" "僧" "外勞" "菲勞" "後勤" "後衛"
         "信使" "公使" "密使" "特使" "秘使"
         ;; TODO: it is unfortunate that 佣 and 傭 are the same in simplified Chinese
         "男優" "女優" "聲優" "空少" "空姐"
         "僕" "中介" "司儀"
         (word-media "媒")
         "CEO" "CPO" "園丁" "方丈" "乞丐" "小丑"
         "刺客" "掮客" "镖客" "駭客" "編劇"
         "武士" "方士" "使领" "娼" "妓" "娼妓"
         "宗師" "使節" "警衛" "皇上" "道士" "進士"
         "牧師" "靈師" "法師" "巫師"
         "包身工" "特工" "志工" "義工" "代工"
         "书记" "尚書" "舵手" "箭手" "劊子手"
         "支书" ;; 支部书记
         "代书" "土地代书" "主管"
         (word-zi3 "子") ;; 子 could be used as prefixes
         (royal-title
          "公爵" "侯爵" "伯爵" "子爵" "男爵" "親王"
          "騎士" "王爵" "紳士" "仕紳" "紳仕"
          "爵位" "爵士")
         (video-producer "製片")
         (student
          ((student-relationship relationship)
           (word-student "學生")
           "門生"
           )
          "留學生" "研究生" "考生"
          "高材生" "高才生" "三好生" "三好學生"
          "儒生" "模範生" "在校生" "生徒"
          )
         (word-tuo1-er "托儿")
         "主幹事" "更夫" "君主" "監製" "帝" "帝王" "君"
         "服務生" "小生" "理監事" "監事" "執事" "參事"
         "博士" "博士後" "碩士"
         "總理"
         "里长" "連長" "財長" "參謀" "議長"
         "股长" "典獄長" "外長" "司長" "廳長" "副長"
         "關長" "总会长" "幹事"
         "護士" "記者" "騙子" "歌王" "歌星" "明星"
         "模特兒" "車模" "模特"
         "詩人" "主持人" "和尚" "白領" "腳夫" "導游" "新聞人" "藝人"
         "太空人" "外太空人" "獵人" "文人" "學人" "商人" "名人" "文化人" "前人"
         "農人" "倭人" "伶人" "偉人" "舉人" "才人" "才子" "販子"
         "公家人" "作者" "公正者" "主教" "領事" "理事"
         "水手" "漢奸" "皇帝" "叫花子" "叫化" "条子"
         "立委" "軍委" "戲子" "太子" "天子"
         "法王" "法王子"
         "建築師" "園藝師" "工程師" "教師" 
         (doctors
          ((doctors-ind ind) "醫")
          ((doctors-relationship relationship)
           "牙醫師" "牙醫" "醫師" "中醫師" 
           )
          "獸醫" "中醫" "西醫""法醫")
         "騎師"
         "教工" "護工" "幹工" "勞工" "苦力"
         "工匠" "門子" "教頭"
         (word-ren2-yuan2 "人員")
         ((occupation-compound compound) "研究人員")
         "演員" "工作人員" "服務員" "收票員" "公務員" "航天員" "飛行員"
         "講解員" "售貨員" "船員" "閣員"
         "議員" "董事" "中央委員" "眾議員" "宇航员"
         ((committee-member ind) "委員")
         "演职员" "職員" "教職員" "科员" "卫生员" "海員" "探員"
         "幹員"
         "職工" "工人" "農民" "女工" "編輯" "總編輯" "書童" "女僕" "病人" "兒童"
         "礦工" "公關"
         "編導" "領隊" "文案"
         "書法家" "科學家" "畫家" "作家" "專家"
         "政客" "大使" "公僕"
         "小偷" "院士" "司令"
         "澳督" "港督" "拿督" "知府"
         "總統" "總督" "太監" "高層" "宫女" "士大夫"
         "父母官" "文官" "教官" "主官" "官防長官" "百官"
         "外交官" "法官" "官" "縣官" "大法官" "檢察官" "貪官"
         "官員"
         "土匪" "人馬" "北方佬"
         "管家" "軍評家" "砖家" "史家" "曲作家"
         "保安" "間諜" "主席"
         (police
          ((police-ind ind) "警")
          "刑警" "交警" "警察" "公安" "員警" "水警"
          "法警" "民警" "軍警"
          )
         (team "團隊" "職棒隊" "部隊" "團體" "族群")
         (@ army-like
          ((army-like-word-ind ind) "軍")
          ((army-like-ind ind) "軍隊")
          "軍閥" "千軍萬馬"
          "千军" "伪军" "三军"
          "陸軍" "红军" "海空军" "海军" "空军" "皇军" "水军"
          "軍人" "士兵" "將士"
          (army-like-word-general
           ((army-like-word-general-ind ind) "將")
           "將軍" "將領" "將帥")
          (army-like-word-tian1-jiang1 "天將")
          "元帥" "帥" "統帥"
          "上將" "中將" "少將" "準將"
          "大校" "上校" "中校" "少校"
          "上尉" "中尉" "少尉" "準尉"
          "士官"
          "上士" "中士" "下士"
          "上兵" "兵" "水兵" "精兵" "憲兵"
          "卒" "連" "紅衛兵" "標兵"
          "散兵" "剩勇" "游勇" "衛" "隊"
          "衛兵" "步隊" "縱隊" "中隊"
          "騎兵" "步兵" "弓兵"
          "輕騎" "鐵騎" "車騎" "鏢騎"
          (army-like-shi1 "師" "王师" "水師")
          ;; 營 also means a camp, and a unit of army
          ;; see camp-or-army
          (army-like-lu3
           ((army-like-lu3-ind ind) "旅")))
         (queen "王后"
                ((word-queen compound)
                 ;; to give more penalty to this character, which in
                 ;; simplified chinese is often confused with 後
                 "后"))
         (word-wang2 "王")
         ((word-di2-wei3 abstract)
          ;; could mean enemy, or '敌方的虚实'
          "敌伪")
         "國王" "公主" "大臣"
         "天帝" "仙女" "使者" "導演" "幹部"))
     (@ animal
      ((young-animal-ind ind) "崽")
      ((animal-ind ind) "獸" "蟲")
      ((animal-relationship relationship)
       "寵物"
       )
      "動物"
      "狗" "貓" "貓咪" "警犬" "犬" "兔" "蝸牛"
      "喪家之犬" "比特犬" "比特鬥牛㹴" "鬥牛㹴"
      "重腳目" "鈍腳目" "蚯蚓" "蛙" "蟾蜍" "蟾" "蜍"
      "蝙蝠" "蝠" "蝦蟆" "癩蝦蟆" "蟆" "蛤蟆" "癩蛤蟆"
      "大象"
      ;; 象 is elsewhere, in appearance
      (insect
       "昆蟲"
       "蛹" ;; a stage for some insects
       "瓢蟲"
       "蟪蛄" "蟪" "蛄" "伏天兒"
       "螻" "螻蛄"
       "草蜢" "蜢" "蚱蜢" "螞蚱" "螽斯" "蝗" "螞蚱" "蝗蟲"
       "草螟" "螟" "螟蛉"
       "蟈蟈" "螽蟴"
       "蟻" "蟻王" "螞蟻" "白蟻" "足絲蟻"
       "蛛" "蜘蛛"
       "蠅" "蒼蠅" "虻" "蚊" "蝨"
       "蜂" "蜜蜂" "螞蜂" "馬蜂" "黄蜂"
       "蝶" "蝴蝶" "蛺蝶" "小灰蝶" "挵蝶" "鳳蝶" "粉蝶"
       "蛾" "天蠶蛾" "天蛾"
       "甲蟲" "雙尾蟲" "原尾蟲" "跳蟲" "鍬形蟲" "竹節蟲" "撚翅蟲"
       "蛉" "黃石蛉" "螳蛉" "長角蛉"
       "蚤" "跳蚤"
       "蜻蜓" "螞螂"
       "蟋蟀" "促織" "蛐" "蛐蛐" "蛐蛐兒" "蟋蟀欸" "蟀子" "蜻蛚" "蹔"
       "金龜子"  "天牛" "椿象" "蟬" "蟑螂" "螳螂" "薊馬")
      "蛇" "蝮蛇" "蝮" "蟒" "蟒蛇"
      "螞蟥" "馬鱉" "鱉" "水蛭" "蛭"
      "熊貓" "熊" "虎" "老虎" "猴" "獅" "鹿" "狼" "狽"
      "犀" "犀牛" "狐狸" "狐" "狸" "豺" "豺狼" "豹"
      "猩" "猩猩" "麓" "麒" "麟" "麒麟" "恐龍"
      "獾" "狗獾" "歐亞獾" "朱獾"
      "粮耗子" "耗子" "鼠" "松鼠" "老鼠"
      (livestock ;; can be quantified with 口
       "牲口" "牲畜" "畜"
       "羊" "羔" "羔羊" "羚" "羚羊" "羯"
       "豬" "豬玀")
      "龍"
      (bird
       ((bird-ind ind) "鳥" "禽" "雛")
       (poultry "家畜" "家禽" "雞" "鴨" "鵝" "火雞"
                "鴨子" ;; problem with 有幾隻鴨子 becoming (有 幾隻鴨) 子
                )
       ;; 雕 also means sculpture
       "丹鳥" "火鳥" "鶤雞" "威鳳" "不死鳥"
       "鸚鵡" "鸚" "鵡" "鵬" "鷲" "琵鷺" "皮鷺"
       "環頸雉" "雉" "鴕" "鴉" "鷺鷥" "鷺" "鷥" "鴿"
       "隼" "鷂" "鶚" "鵟" "鴞" "鶴" "丹頂鶴"
       "鳳凰" "鳳" "凰"
       "喜鵲" "孔雀" "麻雀" "雀" "候鳥" "珍珠鳥" "烏鴉"
       "鷹" "燕" "鶯" "鸝" "雁" "鴻雁" "鴛鴦" "鴛" "鴦")
      "龜" "鰲"
      (under-water
       "海生動物" "水生動物"
       "螃蟹" "龍蝦" "鉗" "牡蠣" "蝦" "蟹"
       "旭蟹" "海臭蟲" "蝦蛄頭" "蛙蟹" "蛙形蟹" "加菲蟹"
       "大閘蟹"
       "水母" "珊瑚"
       "貝殼" "蛤" "貝" "海貝" "螺錢貝" "螺"
       "海豹" "海象" "海馬" "烏賊" "章魚" "海葵" "海星"
       (fish-like ;; can be quantified with "條"
        ((fish-like-ind ind) "魚")
        "銀帶鯽" "鯽" "鯧" "䱽"
        "龍躉" "鱸" "鮭" "三文魚" "鰹" "錦鯉" "鯉"
        "鯊" "鯨" "鰻" "帶魚" "石斑" "紅斑" "星斑" "鼠斑"
        "鯨魚" "海豚" "鰻魚" "鯊魚" "虎鯨" "蘇眉" "鮪"))
      (horse-like
       "毛驢" "驢" "騾"
       (horse "馬" "騎" "坐騎")
       ((cow livestock)
        "牛" "牦" "犛" "初生之犢" "犢")
       (camel "駱駝"))
      )
     (germs-like "微生物" "菌" "病毒" "病原" "病原體"
                 "菌株" "黴")
     (@ god-like
      ((god-ind ind) "神")
      ((god-like-ind ind)
       "佛" "神靈" "仙" "神仙" "妖" "魔" "鬼" "魅" "靈"
       "幽靈" "精靈")
      "上蒼" "菩薩"
      "魔鬼" "釋迦" "阿彌陀佛" "天使" "妖魔" "鬼怪"
      "神明" "聖母"
      ((god-like-name nr-name)
       ((god-like-name-title can-be-title)
        "判官" "真君" "真人"
        )
       "耶穌" "基督" "上帝" "彌賽亞" "瑪利亞" "觀音" "觀世音"
       "三清" "四御"
       "元始天尊" "靈寶天尊" "道德天尊"
       "玉皇大帝" "后土娘娘" "紫微" "勾陳"
       "南極長生大帝" "太乙救苦天尊"

       "先天尊神"
       "王母" "王公"
       "斗姥元尊" "三官大帝" "五方五老"
       "玄天上帝" "雷聲普化天尊"

       "天地山川百神" "星君"
       "九皇大帝" "太陽星君" "太陰星君"
       "魁斗星君" "嫦娥"
       "東嶽大帝" "水仙尊王" "龍王"
       "金光聖母" "雷公"

       "酆都大帝" "閻君" "五方鬼帝"
       "黑白無常" "無常" "無常" "陰陽司"
       "日夜遊神" "日遊神" "夜遊神"

       "聖賢仙真"
       "盤古" "女媧" "伏羲" "神農" "黃帝"
       "八仙" "純陽祖師"
       "九天玄女" "驪山老母"
       "百花仙子" "麻姑" "三茅真君" "黃大仙"

       "護法神"
       "托塔天王" "中壇元帥" "二郎真君" "二郎神"
       "驅魔真君鍾馗" "鍾馗" "關聖帝君"
       "馬天君" "王靈官" "五營神將"
       "法主真君" "輔天真君" "弼天真君"
       
       "俗神"
       "天上聖母" "泰山娘娘" "灶君" "福祿壽" "財神" "門神"
       "城隍" "境主" "福德正神" "月老" "文昌帝君" "天醫真人"
       "天醫" "包公" "保生大帝" "開漳聖王" "廣澤尊王" "靈安尊王"
       "三山國王" "古公三王" "九龍三公" "西秦王爺" "洪聖大王"
       "虎爺" "七星娘娘" "金花娘娘" "臨水夫人" "註生娘娘"
       "武夷真君" "巧聖先師" "岳武穆王" "姜太公" "張仙" "清水祖師"
       "董公祖師" "五府千歲" "五年千歲" "五福王爺")
      )
     ;; represents a side, could be human or other entity, here
     ;; treated as animate
     "阿方" "蒙方" "菲方" "美方" "空方" "朝方"
     "外方" "塞方" "十方" "以方" "中方"
     ;;
     )
  )

;; end animate-list
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(def-tagged-words *animate-suffix-list* *animate-suffix-hash*
  ;; TODO: seems some overlap with general noun-suffix, whether to remove them?
  ((human-suffix human)
   ((s-zhi1-liu2 ind) "之流")
   ((s-zhe3 ind) "者")
   ((s-jia1 ind) "家")
   ((s-shou3 ind) "手")
   ((s-yuan2 ind) "員")
   ;;((s-liang3 ind) "倆") ;; x, retain only the general noun suffix
   ;;((s-men2 ind) "們") ;; x, retain only the general noun suffix
   ((s-bei4 ind) "輩")
   ((s-zhang3 ind) "長")
   ((s-kuang2 ind) "狂")
   ((s-shi4 ind) "士")
   ((s-fu1 ind) "夫")
   ((s-zhu3 ind) "主")
   ((s-lao3 ind) "佬")
   ((s-mi2 ind) "迷")
   ((s-fen1-zi3 ind) "分子" "份子")
   ((s-jie1-ji2 ind) "階級" "階層")
   ((s-dui4 ind) "隊")
   ((s-bao1 ind) "胞")
   ((s-hu4 ind) "户") ;; could also mean an account
   ((student-suffix student)
    ((s-sheng1 ind) "生"))
   )
  (@ occupation
     (occupation-suffix
      ((s-shi1 ind) "師")
      ((s-ding1 ind) "丁")
      ((s-shi3 ind) "使")
      ((human-suffix-or-work work)
       ((s-gong1 ind) "工"))
      ((s-shang1 ind) "商")
      ((s-jiang4 ind) "匠")
      ((s-nong2 ind) "農")
      ((s-fan4 ind) "販")
      ((s-dai4 ind) "代") ;; short for "代表"
      ((s-wei3 ind) "委") ;; short for 委員
      ))
  ;;
  ((animate-suffix animate)
   ((s-fang1 ind) "方")
   ((s-gong1-b ind) "公")
   )
  ;;
  )

;; end animate-suffix-list
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(def-tagged-words *surnames-list* *surnames-hash*
  (@ surname
     "趙" "錢" "孫" "李" "周" "吳" "鄭" "王"
     "馮" "陳" "褚" "衛" "蔣" "沈" "韓" "楊"
     "朱" "秦" "尤" "許" "何" "呂" "施" "張"
     "孔" "曹" "華" "金" "魏" "陶" "姜"
     "戚" "謝" "鄒" "喻" "柏" "水" "竇" "章"
     "雲" "蘇" "潘" "葛" "奚" "范" "彭" "郎"
     "魯" "韋" "昌" "馬" "苗" "鳳" "花" "方"
     "俞" "任" "袁" "柳" "酆" "鮑" "史" "唐"
     "費" "廉" "岑" "薛" "雷" "賀" "倪" "湯"
     "滕" "殷" "羅" "畢" "郝" "鄔" "安" "常"
     "樂" "於" "時" "傅" "皮" "卞" "齊" "康"
     "伍" "余" "元" "卜" "顧" "孟" "平" "黃"
     "穆" "蕭" "尹" "姚" "邵" "湛" "汪"
     "祁" "毛" "禹" "狄" "米" "貝" "明" "臧"
     "計" "伏" "成" "戴" "談" "宋" "茅" "龐"
     "熊" "紀" "舒" "屈" "項" "祝" "董" "梁"
     "杜" "阮" "藍" "閔" "席" "麻" "強"
     "賈" "婁" "危" "江" "童" "顏" "郭"
     "梅" "盛" "林" "刁" "鍾" "徐" "丘" "邱"
     "駱" "高" "夏" "蔡" "田" "樊" "胡" "凌" "霍"
     "虞" "萬" "支" "柯" "昝" "管" "盧" "莫"
     "經" "房" "裘" "繆" "干" "解" "應" "宗"
     "丁" "宣" "賁" "鄧" "郁" "單" "杭" "洪"
     "包" "諸" "左" "石" "崔" "吉" "鈕" "龔"
     "程" "嵇" "邢" "滑" "裴" "陸" "榮" "翁"
     "荀" "羊" "惠" "甄" "麴" "家" "封"
     "芮" "羿" "儲" "靳" "汲" "邴" "糜" "松"
     "井" "段" "富" "巫" "烏" "焦" "巴" "弓"
     "牧" "隗" "山" "谷" "車" "侯" "宓" "蓬"
     "全" "郗" "班" "仰" "秋" "仲" "伊" "宮"
     "甯" "仇" "欒" "暴" "甘" "鈄" "厲" "戎"
     "祖" "武" "符" "劉" "景" "詹" "束" "龍"
     "葉" "幸" "司" "韶" "郜" "黎" "薊" "薄"
     "印" "宿" "白" "懷" "蒲" "邰" "從" "鄂"
     "索" "咸" "籍" "賴" "卓" "藺" "屠" "蒙"
     "池" "喬" "陰" "鬱" "胥" "能" "蒼" "雙"
     "聞" "莘" "黨" "翟" "譚" "貢" "勞" "逄"
     "姬" "申" "扶" "堵" "冉" "宰" "酈" "雍"
     "郤" "璩" "桑" "桂" "濮" "牛" "壽" "通"
     "邊" "扈" "燕" "冀" "郟" "浦" "尚" "農"
     "溫" "別" "莊" "晏" "柴" "瞿" "閻" "充"
     "慕" "連" "茹" "習" "宦" "艾" "魚" "容"
     "向" "古" "易" "慎" "戈" "廖" "庾" "終"
     "暨" "居" "衡" "步" "都" "耿" "滿" "弘"
     "匡" "國" "文" "寇" "廣" "祿" "闕" "東"
     "歐" "殳" "沃" "利" "蔚" "越" "夔" "隆"
     "師" "鞏" "厙" "聶" "晁" "勾" "敖" "融"
     "冷" "訾" "辛" "闞" "那" "簡" "饒" "空"
     "曾" "毋" "沙" "乜" "養" "鞠" "須" "豐"
     "巢" "關" "蒯" "相" "查" "後" "荊" "紅"
     "游" "竺" "權" "逯" "蓋" "益" "桓" "公"
     "万俟" "司馬" "上官" "歐陽"
     "夏侯" "諸葛" "聞人" "東方" "赫連" "皇甫" "尉遲" "公羊"
     "澹臺" "公冶" "宗政" "濮陽" "淳于" "單于" "太叔" "申屠"
     "公孫" "仲孫" "軒轅" "令狐" "鍾離" "宇文" "長孫" "慕容"
     "鮮于" "閭丘" "司徒" "司空" "亓官" "司寇" "仉" "督" "子車"
     "顓孫" "端木" "巫馬" "公西" "漆雕" "樂正" "壤駟" "公良"
     "拓跋" "夾谷" "宰父" "穀梁" "獨孤"
     "晉" "楚" "閆" "法" "汝" "鄢" "塗" "欽"
     "段干" "百里" "東郭" "南門" "呼延"
     "歸" "羊舌" "微生"
     "岳" "緱" "亢" "況"
     "梁丘" "左丘"
     "商" "牟" "佘" "佴" "伯" "賞" "南宮"
     "墨" "哈" "譙" "笪" "陽" "佟"
     ;; very uncommon surname, and may be confusing
     "钞" "钞兀"
     ;;;;
     ;; from https://zh.wikipedia.org/wiki/%E6%97%A5%E6%9C%AC%E5%A7%93%E6%B0%8F%E5%88%97%E8%A1%A8/1-1000
     ;; and https://zh.wikipedia.org/wiki/%E6%97%A5%E6%9C%AC%E5%A7%93%E6%B0%8F%E5%88%97%E8%A1%A8/1001-2000
     ;; more Janpanese surnames (the 1200 most common), some are
     ;; commented out because they are easily confused with normal
     ;; words.  only use the new writing character.
     ;; some surnames are categorized in confusing-surnames below.

     (japanese-surname
      ;; 1-100
      "佐藤" "鈴木" "高橋" "田中" "渡邊" "伊藤" "山本" "中村" "小林" "齋藤"
      "加藤" "吉田" "山田" "佐佐木" "佐々木" "山口" "松本" "井上" "木村" ;; "林" "清水"
      "山崎" "中島" "池田" "阿部" "橋本" "石川" "前田" "小川" ;; "森" "山下"
      "藤田" "岡田" "後藤" "長谷川" "石井" "村上" "近藤" "坂本" "遠藤" "青木"
      "藤井" "藤田" "福田" "太田" "三浦" "藤原" "岡本" "松田" "中川" "中野"
      "原田" "小野" "田村" "竹內" "和田" "石田" "上田" "森田" ;; "中山" "金子" 
      "小島" "柴田" "宮崎" "酒井" "工藤" "橫山" "宮本" "內田" "高木" ;; "原"
      "安藤" "島田" "谷口" "大野" "高田" "丸山" "今井" "河野" "藤本" "村田"
      "武田" "上野" "杉山" "增田" "大塚" "平野" "菅原" "久保" "松井" ;; "小山"
      "千葉" "岩崎" "櫻井" "木下" "野口" "松尾" "菊地" "野村" "新井" "渡部"
      ;; 101-200
      "佐野" "杉本" "大西" "古川" "濱田" "市川" "小松" "高野" "水野" "吉川"
      "山內" "西田" "西川" "菊池" "五十嵐" "福島" "安田" "中田" "平田" ;; "北村"
      "本田" "川崎" "飯田" "服部" "澤田" "久保田" "吉村" "岩田" ;; "東" "中西"
      "川口" "辻" "富田" "川上" "樋口" "永井" "松岡" "田口" ;;  "關" "山中"
      "森本" "矢野" "秋山" "小澤" "廣瀨" "石原" "松下" ;; "大島" "馬場" "土屋"
      "大橋" "松浦" "吉岡" "荒木" "大久保" "淺野" "熊谷" "野田" "川村" ;; "小池"
      "星野" "大谷" "黑田" "尾崎" "永田" "松村" "望月" "內藤" "菅野" ;; "田邊"
      "西山" "堀" "岩本" "平井" "片山" "川島" "本間" "岡崎" "橫田" "早川"
      "鎌田" "小田" "成田" "宮田" "篠原" "須藤" ;; "荒井" "大石" "石橋" "高山"
      "萩原" "大澤" "小西" "栗原" "松原" "伊東" "三宅" "大森" "福井" ;; "南"
      ;; 201-300
      "奧村" "松永" "片岡" "桑原" "內山" "古賀" "奧田" "岡" "北川" ;; "關口"
      "八木" "上原" "吉野" "今村" "中澤" "田島" "澀谷" "上村" ;; "白石" "小泉"
      "中尾氏" "中尾" "平山" "牧野" "岡村" "寺田" "坂口" "兒玉" "河合" ;; "青山" "大山"
      "多田" "竹田" "宮下" "小倉" "小野寺" "小笠原" "足立" "村山" "天野" "坂井"
      "杉浦" "坂田" "小原" "豐田" "角田" "武藤" "河村" "關根" ;; "西" "根本"
      "水谷" "中井" "森下" "神田" "塚本" "佐久間" "植田" "飯塚" "安部" "前川"
      "山根" "淺井" "白井" "宮川" "岡部" "長田" "堀內" "松崎" "飯島" ;; "大川"
      "榎本氏" "榎本" "稻垣" "若林" "森山" "金澤" "江口" "神谷" "中谷" "畠山" ;; "谷"
      "細川" "及川" "安達" "今野" "三上" "西尾" "田代" "石塚" "岸本" "津田"
      "荒川" "長尾" "戶田" "本多" "高島" "森川" "瀧澤" "土井" "三好" ;; "中原"
      ;; 301-400
      "金井" "松山" "米田" "岡野" "稻葉" "村松" "甲斐" "西岡" "佐伯" "岩井"
      "金田" "黑木" "野崎" "藤澤" "落合" "堀田" "廣田" ;; "星" "堤" "泉"
      "西野" "町田" "吉澤" "古田" "宮澤" "德永" "新田" "長島" "山岸" "富永"
      "柳澤" "黑川" "山川" "川田" "松島" "杉田" "奧山" "土田" "三木" "村井"
      "黑澤" "笠原" "須田" "梅田" "大竹" "野中" "堀江" "川端" "大村" "日高"
      "梶原" "西本" "大木" "長澤" "向井" "大場" "竹中" "藤川" ;; "岸" "井口"
      "安井" "榊原" "川原" "吉本" "深澤" "竹下" "西澤" "吉原" "藤岡" ;; "大內"
      "莊司" "福本" "塚田" "宮內" "小谷" "緒方" "谷川" "下田" "竹本" "相澤"
      "藤村" "奧野" "宇野" "漥田" "北野" "栗田" "石黑" "野澤" "龜井" "平川"
      "長野" "宮原" "藤野" "茂木" "島崎" "川本" "下村" "丹羽" "青柳" ;; "山村"
      ;; 401-500
      "竹村" "古谷" "三輪" "高井" "荻野" "大城" "高瀨" "小森" ;; "出口" "田原"
      "宮城" "筒井" "福岡" "矢島" "大原" "福永" "林田" "橫井" "大平" ;; "稻田"
      "金城" "筱崎" "長岡" "平松" "淺田" "越智" "北原" "永野" ;; "溝口" "山岡"
      "武井" "鶴田" "柳田" "北島" "入江" "大田" "濱口" "湯淺" "相馬" ;; "園田"
      "高松" "二宮" "堀川" "手塚" "川野" "沼田" "石崎" "比嘉" "臼井" ;; "石山"
      "宮島" "平岡" "濱崎" "池上" "花田" "谷本" "瀨戶" "西原" "小出" "篠田"
      "杉原" "志村" "根岸" "田畑" "濱野" "笠井" "寺島" "松澤" "寺澤" "三島" "大槻"
      "島村" "倉田" "福原" "片桐" "日野" "小坂" "菅" "堀口" "加納" "河原"
      "新谷" "千田" "松野" "德田" "吉井" "森岡" "柏木" "村瀨" "樹瀨" ;; "田上" "內海"
      "白川" "畑中" "秋元" "大崎" "中本" "小柳" "岩瀨" "原口" "秋田" "三谷"
      ;; 501-600
      "木原" "大井" "川畑" "福山" "米澤" "植木" "岩下" "難波" ;; "島" "米山"
      "古澤" "今泉" "三井" "辻本" "芳賀" "坪井" "井手" "吉永" "河內" "畑"
      "磯部" "長井" "荻原" "大坪" "真鍋" "岸田" "皆川" "細田" "大友" ;; "鹽田"
      "細谷" "植村" "佐竹" "河田" "相原" "若松" "三村" "村岡" ;; "古屋" "遠山"
      "橋口" "松川" "平林" "草野" "川瀨" "栗山" "井出" "保坂" ;; "橘" "有馬"
      "早坂" "瀨川" "瀧本" "志賀" "高岡" "奈良" "半田" "龜山" "高村" "堀井"
      "清野" "玉井" "神山" "朝倉" "富樫" "水口" "河本" "進藤" "富岡" "中里"
      "立石" "岩淵" "葛西" "豐島" "平澤" "藤森" "川合" "北澤" ;; "柳" "柳樹" "水上"
      "龜田" "織田" "武內" "三原" "尾形" "狩野" "宮地" "大津" ;; "有田" "高見"
      "寺本" "藤崎" "植松" "市村" "坂下" "板垣" "西島" ;; "平" "大江" "毛利"
      ;; 601-700
      "江藤" "曾根" "北山" "高柳" "下山" "大沼" "三橋" "立花" ;; "那須" "高原"
      "久野" "木內" "濱本" "野上" "田淵" "門脇" "手島" "瀧口" ;; "淺見" "松木"
      "坂上" "土居" "中根" "平尾" "三澤" "岩佐" "田崎" "石丸" ;; "牧" "深谷"
      "阪本" "市原" "小宮" "長谷" "今田" "守屋" "前原" "高尾" "內野" "柴崎"
      "岩永" "富澤" "川井" "高崎" "關谷" "長瀨" "正木" "飯野" ;; "大倉" "金山"
      "矢部" "外山" "和泉" "山野" "金谷" "塚原" "海野" "鳥居" "西谷" ;; "秦"
      "田川" "成瀨" "木田" "石垣" "大瀧" "石本" "坂元" "門田" "末永" ;; "小寺"
      "長谷部" "富山" "井田" "金森" "小畑" "菅谷" "永島" "奧" ;; "井田制"  "上山" "乾"
      "宮脇" "江崎" "赤松" "相川" "梅澤" "江川" "板倉" "野本" "三田" "永山"
      "島津" "藤木" "杉村" "小杉" "宍戶" "香川" "澤井" "水島" ;; "山上" "小室"
      ;; 701-800
      "黑岩" "梅原" "小關" "松元" "平塚" "喜多" "諏訪" "今西" "井川" ;; "川邊"
      "生田" "森谷" "並木" "宇佐美" "鹽谷" "水田" "佐川" "下川" ;; "秋葉" "細井"
      "石渡" "浦田" "金丸" "真田" "森脇" "染谷" "宮野" "北田" "風間" ;; "布施"
      "新垣" "梅本" "山城" "中林" "大矢" "小椋" "西口" "玉城" "土橋" "高梨"
      "細野" "大庭" "船橋" "山元" "都築" "長崎" "仲田" "阿久津" ;; "木本" "木本植物" "濱"
      "小幡" "杉野" "寺澤" "麻生" "山形" "堀越" "依田" "小野田" "梅津" "羽田"
      "木戶" "野原" "赤木" "淺川" "椎名" "岩間" "日下" "寺尾" "仲村" "宇都宮"
      "矢田" "矢口" "大畑" "大和田" "波多野" "前島" "兒島" "目黑" "立川" ;; "大熊"
      "菅沼" "大貫" "高倉" "深田" "瀧川" "池內" "石澤" "柳原" "岩城" "海老原"
      "倉持" "神崎" "雨宮" "影山" "岡島" "神野" "橋爪" "石坂" "上杉" ;; "栗林"
      ;; 801-900
      "結城" "青野" "川西" "小沼" "白鳥" "瀨尾" "赤坂" "板橋" "小玉" "首藤"
      "清田" "合田" "玉置" "丹野" "尾上" "瀧" "須賀" "竹原" "國分" ;; "角"
      "橫尾" "井原" "坂野" "久米" "森口" "蘆田" "宮坂" "澤" "藤島" "柏原"
      "楠本" "妹尾" "脇田" "池本" "明石" "西脇" "大下" "大和" ;; "北" "三枝"
      "櫻田" "勝又" "大林" "川越" "小久保" "小堀" "本橋" "野島" "有賀" ;; "本村"
      "田端" "志田" "橫川" "浦野" "柳川" "谷村" "坂東" "飛田" ;; "春日" "今"
      "江原" "江原道" "梅村" "內村" "會田" "熊澤" "岡山" "桑田" "楠" "角谷" "日比野"
      "砂川" "益田" "澤村" "安齋" "花岡" "笹川" "中塚" "勝田" "吉崎" "井澤"
      "島袋" "森永" "曾我" "白木" "平良" "小栗" "石倉" "田澤" "前野" ;; "淺沼"
      "小菅" "高畑" "井本" "島本" "玉木" "高谷" "沖田" "倉本" "長濱" ;; "沖"
      ;; 901-1000
      "鶴岡" "高澤" "大浦" "宇田川" "柴山" "本山" "黑崎" "城戶" "鹽見" "岩谷"
      "北條" "畠中" "池谷" "大高" "廣川" "熊田" "重松" "阪口" "野呂" "八田"
      "戶塚" "寺岡" "菅井" "末吉" "井村" "鹿島" "田尻" "石野" "川添" "鹽澤"
      "田所" "古山" "伊澤" "岩澤" "矢澤" "神戶" "丸田" "笹原" ;; "南部" "福地"
      "恩田" "平賀" "米倉" "森島" "增井" "村木" ;; "中" "峰" "福澤" "五味"
      "日下部" "菊田" "森井" "秋本" "磯野" "若山" "安永" "重田" ;; "湊" "寺西"
      "小峰" "新村" "上條" "長友" "今川" "瀧田" "豬股" "深井" "百瀨" ;; "小口"
      "紺野" "熊倉" "中岡" "唐澤" "玉田" "小高" "有村" "岩村" ;; "鬼頭" "氏家"
      "小平" "赤羽" "寺井" "河西" "土谷" "神原" "西浦" "照井" "西井" ;; "境"
      "牧田" "相田" "松谷" "小田島" "藤山" "福士" "品川" ;; "宮裡" "村中" "對馬"
      ;; 1001-1100
      "新保" "夏目" "柿沼" "芹澤" "西森" "持田" "石岡" "松橋" "辻村" "長坂"
      "梶田" "寺崎" "長沼" "木島" "浦" "安川" "大越" "柳瀨" ;; "我妻" "大關"
      "土肥" "磯崎" "上島" "北岡" "牛島" "石村" "古市" "鵜飼" "的場" ;; "平原"
      "野間" "大前" "倉橋" "河崎" "真野" "古橋" ;; "寺内" "小村" "本鄉" "河上"
      "住田" "柿崎" "船木" "船越" "竹澤" "鹿野" "野尻" "鹽崎" ;; "二瓶" "伴"
      "粕谷" "安東" "江頭" "東野" "藤谷" "加瀨" "津村" "湯川" "栗本" "中條"
      "安原" "迫田" "加賀" "平本" "小俁" "五島" "上岡" "濱中" "高坂" ;; "河口"
      "大宮" "相良" "室井" "花井" "仲野" "新川" "江田" "赤井" "森崎" "坪田"
      "神保" "小暮" "小山田" "山脇" "鮫島" "坂" "梅木" "平島" "保田" "矢吹"
      "矢崎" "金野" "塚越" "益子" "伏見" "中森" "金原" "水本" "垣内" ;; "金"
      ;; 1101-1200
      "關本" "竹島" "赤澤" "增山" "郡司" "渥美" "谷内" "福元" "增子" ;; "松林"
      "住吉" "淵上" "赤塚" "稻村" "谷田" "下野" "河井" "鳴海" "高津" ;; "東山"
      "村越" "南雲" "中道" "大坂" "片野" "金本" "東條" "久田" "吉見" "齋木"
      "榊" "梶山" "杉崎" "柿本" "薄井" "堺" "玉川" "藤卷" "大河原" "長山"
      "大岩" "小竹" "川内" "小濱" "棚橋" "梶" "高森" "畑山" ;; "小橋" "神"
      "湯本" "小山内" "八幡" "須永" "桑野" "宇田" "綠川" "櫻庭" ;; "八卷" "椿"
      "下地" "高須" "澤口" "衛藤" "永瀨" "米谷" "竹林" "芝田" "西崎" "伊勢"
      "丸岡" "向山" "人見" "國井" "安西" "末廣" "知念" "大迫" "芝" ;; "二村"
      "磯貝" "村本" "馬淵" "山浦" "木谷" "篠塚" "清原" "浦川" "吉武" ;; "山谷"
      "高本" "福留" "植野" "小宮山" "安岡" "勝山" "飯村" "袴田" "青島" "高杉"
      )
;;;;;
     (confusing-surname ;; easily confused with normal words, would receive extra penalty
      "年" "愛" "言" "福" "有" "琴" "東門" "西門" "帥" "海" "路"
      ;; confusing Japanese names
      "清水" "森" "山下" "金子" "原" "小山" "北村" "中西" "山中" "中山"
      "大島" "馬場" "土屋" "小池" "田邊" "荒井" "大石" "石橋"
      "高山" "南" "關口" "白石" "小泉" "青山" "大山" "西" "根本"
      "大川" "谷" "中原" "星" "堤" "泉" "岸" "井口" "大內" "山村"
      "出口" "田原" "稻田" "溝口" "山岡" "園田" "石山" "田上" "內海"
      "島" "米山" "鹽田" "古屋" "遠山" "橘" "有馬" "柳樹" "水上"
      "有田" "高見" "平" "大江" "毛利" "那須" "高原" "淺見" "松木"
      "牧" "深谷" "大倉" "金山" "秦" "小寺" "井田制"  "上山" "乾"
      "山上" "小室" "川邊" "秋葉" "細井" "布施" "木本" "木本植物" "濱"
      "大熊" "栗林" "角" "北" "三枝" "本村" "春日" "今" "淺沼" "沖"
      "南部" "福地" "峰" "福澤" "五味" "湊" "寺西" "小口"
      "鬼頭" "氏家" "境" "宮裡" "村中" "對馬" "我妻" "大關" "平原"
      "寺内" "小村" "本鄉" "河上" "二瓶" "伴" "河口" "松林" "東山"
      "小橋" "神" "八卷" "椿" "二村" "山谷"
      ;; "中" is too confusing, removed.
      "嚴" "季" "和"
      )
     ;;
     ))

;; end surnames-list
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
